void ProcessDialogEvent()
{
	ref NPChar, sld;
	aref Link, NextDiag;
	int i, iTemp;
	string sTemp;
	
	DeleteAttribute(&Dialog,"Links");
	
	makeref(NPChar,CharacterRef);
	makearef(Link, Dialog.Links);
	makearef(NextDiag, NPChar.Dialog);
	
	switch(Dialog.CurrentNode)
	{
		case "Exit":
			NextDiag.CurrentNode = NextDiag.TempNode;
			DialogExit();
		break;
		
		case "First time":
			dialog.text = "Что вам надо?";
			link.l1 = "Ничего.";
			link.l1.go = "exit";
		break;
		
		case "LEDR_Gonsalo_1":
			if (pchar.sex == "man")
			{
				dialog.text = "Эй, парень! Ты, вижу, моряк бравый, да и поди, рубака лихой. Не поможешь мне совершить вылазку в одно местечко, а?";
			}
			else
			{
				dialog.text = "Эй, красавица! Ты, я вижу, не из робких - раз сюда заявилась. Не поможешь мне совершить вылазку в одно местечко, а?";
			}
			link.l1 = "Полагаю, ты тот самый старик, что ищет проводника к старому кораблю?";
			link.l1.go = "LEDR_Gonsalo_2";
			DelLandQuestMark(npchar);
		break;
		
		case "LEDR_Gonsalo_2":
			dialog.text = "Хех... Значит, слухи бегут быстрее ветра. Да, это я. Гонсало Пералта - единственный кто до сих пор жив, с потерпевшего крушение 'La Espada del Rey'.";
			link.l1 = "А я капитан "+GetFullName(pchar)+". Ты хочешь снова взглянуть на свою посудину?";
			link.l1.go = "LEDR_Gonsalo_3";
		break;

		case "LEDR_Gonsalo_3":
			dialog.text = "Да. Видишь ли, с недавних пор меня мучит один и тот же кошмар. Но дело даже не в нём... Хочешь - верь, хочешь - нет, но каждое утро, как только кошмар заканчивается, я просыпаюсь, и... передо мной стоит чёртов скелет...";
			link.l1 = "В индейском убранстве. Мне говорили, что ты всем рассказываешь эту байку.";
			link.l1.go = "LEDR_Gonsalo_4";
		break;

		case "LEDR_Gonsalo_4":
			dialog.text = "Байку? Хех... Хотел бы я, чтоб это была просто байка. Ещё пару месяцев назад я жил спокойной жизнью, как и положено старому моряку в отставке. Но теперь этот мешок с костями является ко мне каждое утро, смотрит на меня, издаёт истошный крик... книппель мне в парус, у любого боцмана кровь в жилах застыла бы... а после бросается в бой. И знаешь что? Он с каждым разом всё яростнее атакует. Именно поэтому я хочу поскорее добраться до корабля - меня не покидает чувство, что я должен там что-то отыскать.";
			link.l1 = "Хм... Хороши дела. И что же ты хочешь там найти, спустя столько времени?";
			link.l1.go = "LEDR_Gonsalo_5";
		break;
		
		case "LEDR_Gonsalo_5":
			dialog.text = "Я не знаю, капитан, ей-богу не знаю... Но тянет меня к этому кораблю, как старый баркас в шторм. Мой сон, этот скелет и это странное чувство... Клянусь морем, они как-то связаны. Вот только как - ума не приложу.";
			link.l1 = "Что именно происходит в твоём сне? Он как-то связан с индейцами?";
			link.l1.go = "LEDR_Gonsalo_6";
			link.l2 = "Так, значит, ночью ты видишь какие-то видения, а по утрам сражаешься со скелетом? Может, дело не в корабле, а в том, что тебе просто к лекарю пора? Я не стану потакать твоей разыгравшейся фантазии. Поищи другого дурака, который поверит в твои бредни.";
			link.l2.go = "LEDR_Gonsalo_6_end";
		break;
		
		case "LEDR_Gonsalo_6_end":
			DialogExit();
			AddDialogExitQuestFunction("LEDR_End");
		break;
		
		case "LEDR_Gonsalo_6":
			dialog.text = "Ещё как связан, ядро мне в шею... В этом сне я с погибшей командой  на 'La Espada del Rey'. Мы... грабим деревни карибов на Эспаньоле, убиваем всех подряд - мужчин, женщин, детей. Тех, кто сражается, и даже тех, кто падает на колени, умоляя о пощаде. Мы выжигаем поселения одно за другим. Стрелы индейцев, их дубины против нас - что дырявая тартана против военного галеона. Карибы, в отчаянии, просят переговоров, и тогда...";
			link.l1 = "Господь милосердный! Так ты участвовал в этих бесчинствах? Да тебе не помощь нужна, а пеньковый галстук!";
			link.l1.go = "LEDR_Gonsalo_7";
		break;
		
		case "LEDR_Gonsalo_7":
			dialog.text = "Нет! Нет, дьявол меня раздери, не было такого, понимаешь?! Я понятия не имею, почему мне снится всё это... но клянусь всеми святыми, ни я, ни моя команда не участвовали в подобных зверствах!";
			link.l1 = "Тебе же лучше, чтобы это действительно было так. Продолжай.";
			link.l1.go = "LEDR_Gonsalo_8";
		break;

		case "LEDR_Gonsalo_8":
			dialog.text = "Карибы запросили переговоров, и капитан согласился. Он пригласил всех их в одну из тех хижин, которые 'мы' захватили. Вожди пришли - два десятка человек, не меньше, во главе с их королевой - Анакоаной. Только вот сам капитан внутрь не зашёл... никто из нас не зашёл. Как только вошёл последний из вождей - дверь захлопнули и подпёрли балками. А потом... чёрт побери... подожгли. Пощадили только королеву, но ненадолго. Её заставили смотреть, как её народ сгорает живьём... А потом вздёрнули на дереве.";
			link.l1 = "И это повторяется каждую ночь? Один и тот же сон, снова и снова? Знаешь, я не удивлюсь, если после такого, тот скелет - всего лишь плод твоего обезумевшего разума...";
			link.l1.go = "LEDR_Gonsalo_9";
		break;

		case "LEDR_Gonsalo_9":
			dialog.text = "Это ещё не всё. Оставшиеся в живых карибы бежали на Кубу, нашли там поддержку у местных племён и вскоре собрались в одно войско - под началом какого-то вождя. Атуэй - кажется, так его звали. Они шли за ним как за последней надеждой. Но мы перебили всех без труда. Атуэй был схвачен и приготовлен к казни\nКогда его привязали к кресту, готовясь сжечь, монах предложил ему принять истинную веру - сказал, что это облегчит его страдания, и он попадёт в рай. Атуэй спросил монаха, открыт ли рай для испанцев\nИ когда тот сказал, что добрым испанцам он, разумеется, открыт, касик без долгих размышлений ответил, что в таком случае он хочет не рая, а ада - чтобы не иметь общего обиталища с людьми столь жестокими. После этого он сказал ещё несколько фраз на своём языке, и костёр был подожжён. Он не издал ни единого звука, когда пламя взялось за его плоть\nКлянусь морем, не хотел бы я видеть подобное наяву. Мой сон всегда заканчивается одинаково: капитан сидит, не двигается. Только свеча рядом чадит, а он всё листает какой-то потёртый журнал. Медленно, будто каждое слово на вес золота, и бормочет что-то себе под нос. Даже во сне, "+GetSexPhrase("парень","девчонка")+", я понимаю - это знак. Пора хвататься за клинок, ибо он уже атакует\nПомоги мне избавиться от этого кошмара, капитан. Сходи со мной в бухту. В одиночку я туда не сунусь - не хватает уже пороха в пороховницах. Но прежде чем ты ответишь, должен предупредить: заплатить мне тебе нечем, иначе здесь бы уже очередь из помощников выстроилась. Вот и приходится надеяться на помощь нашего брата - моряка.";
			link.l1 = "Что ж, хорошо. Если поход к кораблю поможет тебе избавиться от этих снов и прочих видений, я помогу тебе. Поднимайся на борт. Как только закончу свои дела, мы отправимся в бухту.";
			link.l1.go = "LEDR_Gonsalo_10";
		break;
		
		case "LEDR_Gonsalo_10":
			DialogExit();
			AddDialogExitQuestFunction("LEDR_1");
			AddQuestRecord("LEDR", "2");
			AddQuestUserData("LEDR", "sSex", GetSexPhrase("ся","ась"));
		break;
		
		case "LEDR_Gonsalo_11":
			if (GetHour() >= 7 && GetHour() <= 19)
			{
				dialog.text = "Вот он... Некогда гордость испанского торгового флота, а теперь - кучка гнилых досок, чудом держащихся вместе.";
				link.l1 = "Редко увидишь такую громадину поверженной - лежащей на берегу. Как он здесь очутился?";
				link.l1.go = "LEDR_Gonsalo_12";
				link.l2 = "Тогда давай осмотримся. Может, тебе действительно удастся что-то найти здесь.";
				link.l2.go = "LEDR_Gonsalo_20_1";
				DelLandQuestMark(npchar);
			}
			else
			{
				dialog.text = "Не хочу показаться неблагодарным или трусом... но сейчас мне тут не по себе. Давай вернёмся сюда когда солнце взойдёт?";
				link.l1 = "Хм... Хорошо, приятель, как скажешь.";
				link.l1.go = "exit";
				NextDiag.TempNode = "LEDR_Gonsalo_11";
			}
		break;
		
		case "LEDR_Gonsalo_12":
			dialog.text = "Вышли мы тогда из Сантьяго и держали курс на Севилью. Груза было немного, зато был пассажир один - важная птица, епископ собственной персоной. Команде, скажу честно, такой рейс был не по вкусу... но кто нас когда слушал?\nДо океана мы тогда так и не добрались. У Тёркса нас атаковал пиратский бриг - шустрый, юркий, вооружённый до зубов. Не какие-то доходяги, а настоящие морские волки. Капитан сперва хотел дать крюка - жизнью епископа рисковать не хотелось. Но при таком ветре нельзя было ложиться на обратный курс, а с юга уже гнало шторм. Так что выбирать не пришлось - начался бой.";
			link.l1 = "Оказаться между двумя огнями - участь незавидная. И что же было дальше?";
			link.l1.go = "LEDR_Gonsalo_13";
			AddCharacterExpToSkill(pchar, "Sailing", 200);
		break;

		case "LEDR_Gonsalo_13":
			dialog.text = "Бой долго не продлился. Мы успели перебить им фок-мачту, но и пираты в долгу не остались - шальное ядро перебило штуртрос, и, как по велению дьявола, корабль застыл носом к надвигающемуся шторму. Он приближался так быстро, что пираты - книппель им в грот - предпочли уносить ноги, скрывшись в одной из бухт Тёркса. А нам оставалось только одно - ждать, пока нас поглотит шторм. Капитан скомандовал спустить паруса и заменить штуртрос, вот только было уже поздно.";
			link.l1 = "Значит, шторм подхватил вас у Тёркса, протащил сюда и в конце концов вышвырнул на берег?";
			link.l1.go = "LEDR_Gonsalo_14";
		break;

		case "LEDR_Gonsalo_14":
			dialog.text = "Именно так всё и было. На корабле творился сущий ад. Ветер рвал снасти, мачты валились одна за другой, крушили палубу и давили людей. Кто не успел привязаться - того смыло за борт, а кто успел - того раздавило обломками. В трюме было ничуть не лучше - пушки, ящики, ядра носились туда-сюда, как черти, всё на своём пути перемалывали. Когда нас, в конце концов, вышвырнуло на берег, я был без сознания. Очнулся уже на песке. Меня нашёл боцман Серхио. С ним были ещё двое.";
			link.l1 = "Не густо, для такого большого судна.";
			link.l1.go = "LEDR_Gonsalo_15";
		break;

		case "LEDR_Gonsalo_15":
			dialog.text = "Эх, капитан... Сколько там было трупов... Мы сразу поняли: здесь оставаться нельзя. Волны могли утащить и корабль, и нас следом. Поблизости мы нашли пещеру - там, обессиленные уснули едва коснувшись земли. Когда я проснулся в пещере не было ни Серхио, ни тех двоих\nЯ обыскал весь пляж, но клянусь громом, их там не было. На корабль взобраться в одиночку мне оказалось не по силам и я решил пойти в глубь острова. Так я и добрался до Шарптауна, где по собственной наивности натворил дел\nЯ хотел узнать хоть что-то о выживших, стал рассказывать всем, что с нами произошло. Но этих пройдох заинтересовал не я и не команда, а добро, которое можно было стащить с корабля. Слух быстро облетел весь остров и толпы этих ладронов повалили туда.";
			link.l1 = "Значит, судьба тех людей тебе не известна до сих пор?";
			link.l1.go = "LEDR_Gonsalo_16";
		break;

		case "LEDR_Gonsalo_16":
			dialog.text = "Возвращаться на корабль было слишком опасно. Те, кто рискнул сунуться туда за наживой, могли не поделить добычу и пустить пулю любому, кто окажется рядом… случайно. А может — и вовсе не случайно\nКлянусь морем, я проторчал в таверне целую неделю, выспрашивал каждого, кто побывал в бухте. Но никто не слышал ни о моих парнях, ни о том, что с ними стало\nВ конце концов я смирился с мыслью: похоже, я единственный, кто пережил тот проклятый шторм. Просто судьба оказалась ко мне благосклоннее, чем к остальным. А может... всё дело в обереге, что когда-то вручил мне молодой, тогда ещё капитан Эухенио де ла Торре. Он всегда был при мне. И, чёрт возьми, похоже, он и вправду приносил удачу.";
			link.l1 = "И где же он сейчас? Похоже, от скелетов он не спасает, хех...";
			link.l1.go = "LEDR_Gonsalo_17";
		break;

		case "LEDR_Gonsalo_17":
			dialog.text = "Его сорвало с моей шеи, когда мы обшивали верховье колодца у меня во дворе. Бревно задело мою шею, и оберег упал в воду. Колодец уже был полон, и никто не стал бы вычерпывать его ради одной безделушки.";
			link.l1 = "И с того момента тебе начали сниться кошмары?";
			link.l1.go = "LEDR_Gonsalo_18";
		break;

		case "LEDR_Gonsalo_18":
			dialog.text = "Тысяча чертей! Никогда об этом не задумывался, но ведь так оно и вышло! Как только мы достроили колодец, так кошмары и начались.";
			link.l1 = "Забавное совпадение. Что ж, теперь ты здесь, как и хотел. Что же ты намерен делать дальше?";
			link.l1.go = "LEDR_Gonsalo_19";
		break;

		case "LEDR_Gonsalo_19":
			dialog.text = "Не знаю, капитан... Не знаю. Давай для начала осмотримся - ощущение, что я должен здесь что-то найти только усилилось.";
			link.l1 = "Хорошо. Надеюсь, мы сюда явились не зря.";
			link.l1.go = "LEDR_Gonsalo_20";
		break;
		
		case "LEDR_Gonsalo_20":
			DialogExit();
			AddDialogExitQuestFunction("LEDR_3");
		break;
		
		case "LEDR_Gonsalo_20_1":
			DialogExit();
			AddDialogExitQuestFunction("LEDR_3");
			pchar.questTemp.LEDR_NoStory = true;
		break;
		
		case "LEDR_Gonsalo_21":
			dialog.text = "Послушай... Это чувство только усиливается. Будто я стою в шаге от чего-то, что должен найти. Мне нужно попасть на корабль. Клянусь морем, там есть что-то, что объяснит, почему этот треклятый скелет никак не оставит меня в покое.";
			link.l1 = "Так, может, ты не просто так сюда так рвался? Припрятал на корабле что-то ценное, а теперь решил вернуться за своим добром?";
			link.l1.go = "LEDR_Gonsalo_22";
		break;

		case "LEDR_Gonsalo_22":
			dialog.text = "Что за вздор? Думаешь, я бы притащился сюда через весь архипелаг ради пары дублонов спустя сорок лет? Да если бы к тебе хоть раз пришлось повидать того скелета, у тебя бы таких мыслей не возникло.";
			link.l1 = "Ну ладно, ладно, не кипятись. И каким образом ты собираешься попасть на корабль?";
			link.l1.go = "LEDR_Gonsalo_23";
		break;

		case "LEDR_Gonsalo_23":
			dialog.text = "На корме есть потайная дверь. Капитан сам её выпилил - на случай, если абордаж пойдёт не в нашу пользу. Клянусь громом, в одиночку мне свою старую тушку туда не затащить, но вдвоём...";
			link.l1 = "Что ж, показывай дорогу, и покончим с этим.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("LEDR_5");
		break;
		
		case "LEDR_Gonsalo_24":
			DelLandQuestMark(npchar);
			dialog.text = "Ядро мне в шею, ну и заварушка! Повезло, что эти не такие свирепые, как тот, что ко мне по утрам является. Ну что, теперь-то ты мне веришь?";
			link.l1 = "После такого зрелища сложно не поверить. Ты как? Цел?";
			link.l1.go = "LEDR_Gonsalo_24_1";
		break;
		
		case "LEDR_Gonsalo_24_1":
			dialog.text = "Кажется, да. Проклятые нежити... ноги подкосились, как перебитые мачты.";
			link.l1 = "Ну раз цел - хватит рассиживаться. Давай руку, я помогу тебе встать.";
			link.l1.go = "LEDR_Gonsalo_24_2";
		break;
		
		case "LEDR_Gonsalo_24_2":
			CharacterTurnByChr(npchar, CharacterFromID("blaze"));
			dialog.text = "...";
			link.l1 = "Так-то лучше. Похоже, мы не первые, кто знал, как сюда попасть.";
			link.l1.go = "LEDR_Gonsalo_25";
			LAi_Fade("LEDR_GonsaloStay", "");
		break;

		case "LEDR_Gonsalo_25":
			dialog.text = "Кажется, это мои ребята. Те, кто пережил шторм... Я узнал камзол Серхио... вернее, то, что от него осталось. Значит, они вернулись - либо искать выживших, либо похоронить погибших. Да вот только, похоже, их перебила эта же нечисть.";
			link.l1 = "Удивительно, что одежды сохранился только лоскуты жилетки. И больше ничего.";
			link.l1.go = "LEDR_Gonsalo_26";
		break;

		case "LEDR_Gonsalo_26":
			if(CheckAttribute(pchar, "questTemp.LEDR_NoStory"))
			{
			dialog.text = "Даже от рясы нашего пассажира - епископа следа не осталось. Судя по ключу, зажатому в руке, вон тот бедолага это он и есть. Он ни на секунду не расставался с этим ключом. Видать, ему повезло ничуть не больше, чем другим. Клянусь морем - эта нежить не просто так здесь шастала. Что-то держит их здесь, или они что-то охраняют.";
			DeleteAttribute(pchar, "LEDR_NoStory");
			}
			else
			{
			dialog.text = "Даже от рясы епископа и следа не осталось. Судя по ключу, зажатому в руке, вон тот бедолага это он и есть. Он ни на секунду не расставался с этим ключом. Видать, ему повезло ничуть не больше, чем другим. Клянусь морем - эта нежить не просто так здесь шастала. Что-то держит их здесь, или они что-то охраняют.";
			}
			link.l1 = "Теперь и у меня появилось ощущение, что мы должны здесь что-то найти. Давай покончим с этим поскорее - я не горю желанием задерживаться здесь дольше, чем нужно.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("LEDR_8");
		break;
		
		case "LEDR_Gonsalo_27":
			dialog.text = "Ну, что там, капитан? Удалось найти что-нибудь?";
			link.l1 = "Похоже, это был сундук епископа. Я наш"+GetSexPhrase("ёл","ла")+" в нём кое-что. Взгляни.";
			link.l1.go = "LEDR_Gonsalo_28";
		break;

		case "LEDR_Gonsalo_28":
			dialog.text = "Веласкес... Разрази меня гром... Я видел этот дневник в своих снах! Именно его листал капитан, перед тем как...";
			link.l1 = "...";
			link.l1.go = "LEDR_Gonsalo_29";
		break;

		case "LEDR_Gonsalo_29":
			dialog.text = "Дьявол, он словно жжёт мне руки!";
			link.l1 = "Жжёт руки? Да ладно тебе, это же просто старый дневник... Пусть и с жутким содержанием. Или ты правда веришь, что в нём есть какая-то тёмная сила?";
			link.l1.go = "LEDR_Gonsalo_30";
		break;

		case "LEDR_Gonsalo_30":
			dialog.text = "Клянусь всеми святыми, я не шучу! Этот чёртов дневник будто пылает у меня в руках. Его нужно уничтожить! Разорвать, сжечь, утопить - что угодно! Хотя нет... Лучше сжечь. Да, именно сжечь, чтобы от него не осталось и пепла!";
			link.l1 = "Как пожелаешь. Тогда идём на берег, разведём костёр и отправим эту чёртову летопись злодеяний в огонь.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("LEDR_10");
		break;
		
		case "LEDR_Gonsalo_31":
			dialog.text = "Ну вот и всё... Будто якорь с души сорвался.";
			link.l1 = "Думаешь, теперь всё кончено?";
			link.l1.go = "LEDR_Gonsalo_32";
			TakeItemFromCharacter(pchar, "LEDR_book");
			CharacterTurnToLoc(npchar, "goto", "fire");
			CharacterTurnToLoc(pchar, "goto", "fire");
		break;

		case "LEDR_Gonsalo_32":
			dialog.text = "Кто знает... Но клянусь морем, давно мне так легко не дышалось. Будто старый долг наконец отпущен. Только всё же... Лучше б я никогда не видел этот проклятый дневник. И не знал, что в нём написано.";
			link.l1 = "Не удивительно, что тебе такое снилось. Хоть ты и не участвовал во всём этом, ты единственный, из живых кто хоть как-то был связан с дневником.";
			link.l1.go = "LEDR_Gonsalo_33";
		break;
		
		case "LEDR_Gonsalo_33":
			dialog.text = "Ни золото, ни вера не оправдывают, что творили люди под командованием Веласкеса. И я рад, что всё, что могло об этом напомнить, сгорело. Такие вещи не должны попадать в руки тем, кто вздумает взять с них пример.";
			link.l1 = "Веласкес - лишь один из многих. Кто знает, сколько ещё таких дневников ходят по рукам в старушке Европе, подогревая жадность и безнаказанность новых завоевателей? Одно радует - этот больше никого не отравит. Кстати, в сундуке епископа был не только дневник, но и добрый запас дублонов - три сотни. Половина из них по праву твоя.";
			link.l1.go = "LEDR_Gonsalo_34_share";
			link.l2 = "Веласкес поплатился за свои грехи, и если кто-то решит пойти его путём - его ждёт та же участь. Рано или поздно, судьба воздаст каждому по заслугам.";
			link.l2.go = "LEDR_Gonsalo_34_silence";
		break;
		
		case "LEDR_Gonsalo_34_share":
			dialog.text = "Раз так - не откажусь. Деньги всем нужны, а мне сейчас особенно. Меня уже ни на один корабль матросом не возьмут - старый я стал. Так что спасибо, капитан, что не отмахнул"+GetSexPhrase("ся","ась")+", как другие.";
			link.l1 = "Признаюсь, история твоя сначала показалась мне бредом полоумного. Но рассказывал ты её так убедительно, что, хочешь не хочешь, а поневоле начинаешь верить. И всё же, появление тех индейских нежитей застало меня врасплох.";
			link.l1.go = "LEDR_Gonsalo_35_1";
			link.l2 = "Я просто решил проверить, не безумен ли ты. Сам понимаешь, поверить в такие истории не так уж и просто.";
			link.l2.go = "LEDR_Gonsalo_35_2";
			RemoveDublonsFromPCharTotal(150);
			ChangeCharacterComplexReputation(pchar, "nobility", 1);
			npchar.quest.LEDR_share = true;
		break;
		
		case "LEDR_Gonsalo_34_silence":
			dialog.text = "Хочется в это верить... Но клянусь морем, я видел слишком многих, кому судьба улыбалась, несмотря на все их чёрные дела. Может, расплата их и настигнет - но уже там, в чёртовом котле. А тебе спасибо, капитан. За то, что не отвернулся, выслушал и проводил. Это, знаешь ли, многого стоит.";
			link.l1 = "Признаюсь, история твоя сначала показалась мне бредом полоумного. Но рассказывал ты её так убедительно, что, хочешь не хочешь, а поневоле начинаешь верить. И всё же, появление тех индейских нежитей застало меня врасплох.";
			link.l1.go = "LEDR_Gonsalo_35_1";
			link.l2 = "Я просто решил проверить, не безумен ли ты. Сам понимаешь, поверить в такие истории не так уж и просто.";
			link.l2.go = "LEDR_Gonsalo_35_2";
			ChangeCharacterComplexReputation(pchar, "nobility", -2);
		break;

		case "LEDR_Gonsalo_35_1":
			dialog.text = "Теперь ты знаешь, что я почувствовал, когда впервые увидел эту нежить. Надеюсь, с ней покончено навсегда... Иначе следующую такую встречу я вряд ли переживу.";
			link.l1 = "Что ж, раз мы тут закончили, пора убираться отсюда. Поднимайся на борт, я высажу тебя в порту Шарптауна.";
			link.l1.go = "LEDR_Gonsalo_36";
			AddCharacterExpToSkill(pchar, "leadership", 100);
		break;

		case "LEDR_Gonsalo_35_2":
			dialog.text = "Теперь ты знаешь, что я почувствовал, когда впервые увидел эту нежить. Надеюсь, с ней покончено навсегда... Иначе следующую такую встречу я вряд ли переживу.";
			link.l1 = "Что ж, раз мы тут закончили, пора убираться отсюда. Поднимайся на борт, я высажу тебя в порту Шарптауна.";
			link.l1.go = "LEDR_Gonsalo_36";
			AddCharacterExpToSkill(pchar, "Fortune", 100);
		break;
		
		case "LEDR_Gonsalo_36":
			DialogExit();
			AddDialogExitQuestFunction("LEDR_12");
		break;
		
		case "LEDR_Gonsalo_37":
			dialog.text = "Ещё раз спасибо, капитан "+GetFullName(pchar)+". Клянусь морем, то странное чувство исчезло, и надеюсь, оно забрало с собой свой проклятый мешок с костями. Может, пропустим по кружечке, а?";
			link.l1 = "Благодарю за приглашение, Гонсало, но у меня ещё дел по горло. Может, в другой раз. Выпей за нас обоих.";
			link.l1.go = "LEDR_Gonsalo_38";
		break;
		
		case "LEDR_Gonsalo_38":
			if (CheckAttribute(npchar, "quest.LEDR_share"))
			{
				dialog.text = "Понимаю. Но скажу тебе так, капитан: после всего, что мы с тобой пережили, не могу уйти вот так, не поблагодарив. Не по-человечески это. Вот, держи. В молодости я не раз за кладами гонялся, клянусь морем. А теперь уже здоровье не то, да и спина подводит. А ты - молодой, матёрый морской волк. Добудешь его без труда. Удачи тебе, "+GetFullName(pchar)+", попутного ветра и семь футов под килем.";
				link.l1 = "Спасибо, Гонсало. И тебе удачи, прощай.";
				AddMapPart();
			}
			else
			{
				dialog.text = "Ну что ж, значит, пришло время прощаться. Попутного ветра и семь футов под килем, капитан "+GetFullName(pchar)+"!";
				link.l1 = "Всего доброго, Гонсало.";
			}
			link.l1.go = "exit";
			AddDialogExitQuestFunction("LEDR_14");
		break;
		
		
		
	}
}