void ProcessDialogEvent()
{
	ref NPChar, sld;
	aref Link, NextDiag;
	int i, iTemp;
	string sTemp;
	
	DeleteAttribute(&Dialog,"Links");
	
	makeref(NPChar,CharacterRef);
	makearef(Link, Dialog.Links);
	makearef(NextDiag, NPChar.Dialog);
	
	switch(Dialog.CurrentNode)
	{
		case "Exit":
			NextDiag.CurrentNode = NextDiag.TempNode;
			DialogExit();
		break;
		
		case "First time":
			dialog.text = "Что вам надо?";
			link.l1 = "Ничего.";
			link.l1.go = "exit";
		break;
		
		case "Poorman_1":
			if (pchar.sex == "woman")
			{
				dialog.text = "Эй, красавица, как насчёт изысканного украшения для вашей дамской коллекции? Настоящая драгоценность! Вам - восхищённые взгляды, а мне - пара монет на хлеб и глоток рома.";
			}
			else
			{
				dialog.text = "Эй, кэп, как насчёт изысканного подарка для вашей дамы? Настоящая драгоценность! Вам - её тёплые благодарности, а мне - пара монет на хлеб и глоток рома.";
			}
			link.l1 = "Чтобы через час за мной пришли солдаты и упекли в тюрьму за кражу? Где ты его взял, бродяга?";
			link.l1.go = "Poorman_2_fortune";
			link.l2 = "Изысканного подарка? И откуда же ему взяться у бездомного, вроде тебя?";
			link.l2.go = "Poorman_2_leadership";
			if (npchar.quest.meeting == "0") npchar.quest.meeting = "1";
		break;
		
		case "Poorman_2_fortune":
			dialog.text = ""+GetSexPhrase("Кэп, я","Я")+" этот прекрасный кулон с камеей нашёл, честное слово! Да чтоб мне провалиться, если вру! Лежал себе, никому не нужный. Ну не бросать же такую красоту в грязи, верно?";
			link.l1 = "Ну ладно. Показывай, что там у тебя?";
			link.l1.go = "Poorman_3";
			link.l2 = "Кто же на слово поверит, такому достопочтенному господину как ты? Поищи кого-нибудь другого, кто подоверчивее будет.";
			link.l2.go = "Poorman_exit";
			AddCharacterExpToSkill(pchar, "Fortune", 100);
		break;
		
		case "Poorman_2_leadership":
			dialog.text = ""+GetSexPhrase("Кэп, я","Я")+" этот прекрасный кулон с камеей нашёл, честное слово! Да чтоб мне провалиться, если вру! Лежал себе, никому не нужный. Ну не бросать же такую красоту в грязи, верно?";
			link.l1 = "Ну ладно. Показывай, что там у тебя?";
			link.l1.go = "Poorman_3";
			link.l2 = "Кто же на слово поверит, такому достопочтенному господину как ты? Поищи кого-нибудь другого, кто подоверчивее будет.";
			link.l2.go = "Poorman_exit";
			AddCharacterExpToSkill(pchar, "Leadership", 100);
		break;
		
		case "Poorman_exit":
			DialogExit();
			AddDialogExitQuestFunction("TBP_PismoVDome");
		break;
		
		case "Poorman_3":
			dialog.text = "Смотрите... вещица знатная! Нашёл её на клумбе, у дома с фонарём, рядом с таверной. Только там уж давно ни души, так что возвращать некому.";
			link.l1 = "Любопытная побрякушка. И сколько ты за неё хочешь?";
			link.l1.go = "Poorman_4";
		break;
		
		case "Poorman_4":
			dialog.text = "Всего сто песо"+GetSexPhrase(", кэп","")+"... сущие пустяки для такого человека, как вы! А мне - целая неделя без забот о том, где достать кусок хлеба. Вы только взгляните, какая красота!";
			if (sti(pchar.Money) >= 100)
			{
				link.l1 = "Ладно, держи свои сто песо.";
				link.l1.go = "Poorman_5";
			}
			link.l2 = "Пожалуй, обойдусь. Попытай счастья у кого-нибудь другого.";
			link.l2.go = "Poorman_exit";
		break;
		
		case "Poorman_5":
			dialog.text = "Спасибо, "+GetAddress_Form(NPChar)+"! Теперь удача вам обязательно улыбнётся! Хороший вы человек, сразу видно.";
			link.l1 = "...";
			link.l1.go = "Poorman_exit";
			GiveItem2Character(PChar, "jewelry24");
			pchar.questTemp.TBP_BuyKulon = true;
			pchar.questTemp.TBP_BuyKulonOtdatBetsy = true;
		break;
		
		case "Pirate_1":
			if (pchar.sex == "woman")
			{
				dialog.text = "О-о-о, а кто это к нам заглянул? Да ты, похоже, не ошиблась дверью, крошка... ты проходи, проходи! Раздевайся, чувствуй себя как дома.";
				link.l1 = "Так-так... Кто тут у нас? Уж не те ли самые мерзавцы, что оставили для Бетси 'нежное' послание с угрозами?";
			}
			else
			{
				dialog.text = "А эт-т-то ещё что за каракатица?! Ты дверью не ошибся, башка ты козья? Проваливай отсюда, пока я тебе брюхо не вспорол!";
				link.l1 = "Так-так... Кто тут у нас? Уж не те ли самые олухи, что оставили для Бетси милое послание с угрозами?";
			}
			link.l1.go = "Pirate_2";
			PlaySound("Voice/Russian/citizen/Pirati v Gorode-12.wav");
			//PlaySound("Voice/Spanish/citizen/Pirati v Gorode-12.wav");
		break;
		
		case "Pirate_2":
			if (pchar.sex == "woman")
			{
				dialog.text = "Бетси? Да к чёрту эту Бетси! Гораздо интереснее, что ты здесь забыла, сладенькая... Раз уж зашла - не спеши уходить, мы придумаем, чем тебя занять...";
			}
			else
			{
				dialog.text = "Какой ещё к дьяволу Бетси? Не искушай судьбу, болван. Пока можешь уйти на своих двоих - уходи. А не то придётся тебя складывать по кускам и выносить в ведре!";
			}
			link.l1 = "...";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_HouseBetsi_2");
		break;
		
		case "BetsiPrice_1":
			dialog.text = "Помогите! Помогите, умоляю вас!";
			link.l1 = "...";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_HouseBetsi_3");
			locCameraFromToPos(1.40, 1.62, 1.14, false, 2.58, -0.30, -1.64);
		break;
		
		case "Pirate_3":
			dialog.text = "...";
			link.l1 = "А вот и она. Вляпался ты по самые уши, приятель, и если не хочешь, чтобы это стало твоей последней ошибкой, советую отпустить её. Немедленно.";
			link.l1.go = "Pirate_4";
		break;
		
		case "Pirate_4":
			dialog.text = "Ха! Слыхал, Реджи? Он"+GetSexPhrase("","а")+" ещё и угрожает. "+GetSexPhrase("Какой самоуверенный слизняк","Какая самоуверенная дрянь")+". Ну-ка, покажем "+GetSexPhrase("этому выскочке, какого цвета у него кишки","этой выскочке, что такое настоящая боль")+".";
			link.l1 = "Вам же хуже.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_HouseBetsi_4");
		break;
		
		case "Pirate_5":
			if (!CharacterIsAlive("TBP_Bandit_1"))
			{
				dialog.text = "...";
				link.l1 = "А теперь выпускай девчонку. Или ляжешь рядом со своим дружком.";
				link.l1.go = "exit";
				AddDialogExitQuestFunction("TBP_HouseBetsi_6");
			}
			else
			{
				dialog.text = "...";
				link.l1 = "...";
				link.l1.go = "exit";
				NextDiag.TempNode = "Pirate_5";
			}
		break;
		
		case "BetsiPrice_2":
			dialog.text = "Чёртовы псы! Думали, я буду молчать?!";
			link.l1 = "...";
			link.l1.go = "BetsiPrice_2_1";
			sld = CharacterFromID("TBP_Bandit_2");
			LAi_SetActorType(sld);
			LAi_ActorTurnToCharacter(sld, CharacterFromID("TBP_BetsiPrice"));
			CharacterTurnByChr(npchar, sld);
		break;
		
		case "BetsiPrice_2_1":
			dialog.text = "А ты... Ты, похоже, не с ними. Кто ты?";
			link.l1 = "Капитан "+GetFullName(pchar)+", к твоим услугам.";
			link.l1.go = "BetsiPrice_2_2";
			CharacterTurnByChr(npchar, pchar);
		break;
		
		case "BetsiPrice_2_2":
			dialog.text = "Значит, я тебе жизнью обязана?";
			link.l1 = "Похоже на то. Но сейчас важнее другое - кто эти люди и во что ты вляпалась?";
			link.l1.go = "BetsiPrice_3";
		break;
		
		case "BetsiPrice_3":
			dialog.text = "Эти люди... Их послал один важный английский чиновник. Когда-то он был мне очень близок... а теперь, как видишь, желает моей смерти.";
			link.l1 = "Кажется, я начинаю разбираться в твоей истории. Ты была его любовницей, но в какой-то момент решила, что можешь использовать это в своих интересах. Хотела припугнуть его... рассказать семье?";
			link.l1.go = "BetsiPrice_4";
		break;
		
		case "BetsiPrice_4":
			dialog.text = "Ты удивительно близ"+GetSexPhrase("ок","ка")+" к истине, "+GetSexPhrase("красавчик","милашка")+" и в то же время очень далёк"+GetSexPhrase("","а")+" от неё. Будь это так, к этому моменту я бы была уже мертва. Да, я была его любовницей, но мне и в голову не приходило устраивать семейные драмы\nВсё было куда сложнее: однажды я узнала, что он нашёл себе новую игрушку и решил избавиться от меня, оставив с пустыми руками. Просто выбросить, как ненужную вещь. Ну а я не привыкла уходить ни с чем\nТак что я забрала то, что действительно имело ценность - бумаги, способные разрушить его жизнь, - и сбежала в Новый Свет. А затем предложила сделку: его секреты в обмен на мою безопасность и щедрую компенсацию\nИменно поэтому я всё ещё жива - им нужны документы. А я не торопилась раскрывать, где они спрятаны.";
			link.l1 = "Ну что ж, ты не только красива, но ещё и чертовски хитра. Ты сыграла смело, но давай будем честны - эта игра уже вышла из-под твоего контроля. Может, пора задуматься о другом варианте, пока ещё есть возможность попробовать выйти из игры? Если они нашли тебя здесь, то вряд ли ты сможешь спрятаться где-то ещё. Рано или поздно твоя удача закончится.";
			link.l1.go = "BetsiPrice_5";
		break;
		
		case "BetsiPrice_5":
			dialog.text = "Что же ты предлагаешь? Просто отдать ему документы и остаться с пустыми руками? После всего, что я пережила?";
			link.l1 = "Ты ведь понимаешь, что для них ты всего лишь проблема, которую нужно убрать. Они не остановятся, пока не добьются своего. Но у тебя ещё есть выбор. Отдай документы вон тому недоумку. Пусть он передаст их своему хозяину и заверит его, что ты отказалась от своих намерений и просто хочешь, чтобы всё это закончилось.";
			link.l1.go = "BetsiPrice_6";
		break;
		
		case "BetsiPrice_6":
			dialog.text = "Если это мой единственный шанс... Хорошо, я готова рискнуть. Документы всегда были при мне. Я вшила их в корсет, чтобы не расставаться с ними ни на миг. Сейчас, секунду...";
			link.l1 = "...";
			link.l1.go = "BetsiPrice_7";
		break;
		
		case "BetsiPrice_7":
			dialog.text = "Вот, держи. Здесь все документы, которые у меня были. Скажешь этой твари пару напутственных слов? Ты ведь умеешь быть убедительн"+GetSexPhrase("ым","ой")+"?";
			link.l1 = "Думаю, главный урок он уже усвоил. Теперь осталось только донести до него, что он должен сделать.";
			link.l1.go = "exit";
			notification(StringFromKey("Neutral_15"), "BoxMinus");
			PlaySound("interface\important_item.wav");
			AddDialogExitQuestFunction("TBP_HouseBetsi_11");
		break;
		
		case "Pirate_6":
			dialog.text = "...";
			link.l1 = "Слушай меня внимательно, ублюдок. Вот документы, за которыми вас послали. Отнеси их своему хозяину и передай: если он продолжит слать убийц за головой Бетси, их ждёт та же участь, что и твоих дружков. Скажи ему, что она уходит из его жизни навсегда - и у него больше нет причин её преследовать. Пусть примет это как её добровольный шаг к примирению. Надеюсь, он окажется достаточно разумен, чтобы на этом всё закончить. Ты всё понял, или мне нужно вбить эту информацию в твою голову?";
			link.l1.go = "Pirate_7";
			notification(StringFromKey("Neutral_16"), "BoxMinus");
			PlaySound("interface\important_item.wav");
		break;
		
		case "Pirate_7":
			dialog.text = "Я всё понял, "+GetAddress_Form(NPChar)+"...";
			link.l1 = "Тогда проваливай отсюда. И не вздумай задерживаться - второго шанса у тебя не будет.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_HouseBetsi_12");
		break;
		
		case "BetsiPrice_8":
			dialog.text = "Ну, "+GetSexPhrase("мой герой","моя фурия")+", кажется, я забыла поблагодарить тебя... Это всё из-за волнения. Не каждый день оказываешься в плену, а затем обретаешь свободу благодаря "+GetSexPhrase("отважному спасителю","отважной спасительнице")+". Скажи, это у тебя привычка - выручать дам из неприятностей, или мне просто невероятно повезло?";
			link.l1 = "Что могу сказать, Бетси, у меня слабость к эффектным появлениям и "+GetSexPhrase("прекрасным дамам","разного рода приключениям")+".";
			link.l1.go = "BetsiPrice_9";
		break;
		
		case "BetsiPrice_9":
			dialog.text = "Меня зовут Миранда. Миранда Белл. Имя Бетси я взяла, когда пришлось исчезнуть - новая жизнь, новое имя, сам"+GetSexPhrase("","а")+" понимаешь. Я бежала из Европы так поспешно, что прихватила лишь несколько монет и пару украшений\nОстальное, вероятно, досталось тем ублюдкам, что за мной охотились. Теперь вместо роскошных приёмов и дорогих нарядов - убогая лачуга на отшибе и работа в таверне. Никогда не думала, что однажды буду подавать ром, вместо того чтобы смаковать вино в хорошей компании...";
			link.l1 = "Даже при всём этом ты выглядишь так, будто держишь судьбу в своих руках. Возможно, в этом и кроется твой настоящий талант.";
			link.l1.go = "BetsiPrice_10";
		break;
		
		case "BetsiPrice_10":
			dialog.text = ""+GetSexPhrase("Льстец. Но, знаешь, тебе это только к лицу","Ты мне льстишь")+"... После всего этого мне как-то не по себе. Вдруг за углом меня уже поджидают? Проводи меня домой, побудь "+GetSexPhrase("моим спасителем","моей спасительницей")+" ещё чуть-чуть.";
			link.l1 = "Я не из тех, кто бросает начатое на полпути. А значит, сударыня, я к вашим услугам. Идём.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_ProvodimDoDoma");
		break;
		
		case "BetsiPrice_11":
			dialog.text = "Вот мы и пришли. Знаешь, а я ведь даже не спросила, каким ветром тебя занесло в тот дом?";
			link.l1 = "Я оказал"+GetSexPhrase("ся","ась")+" там не случайно. Трактирщик, кажется, всерьёз расстроился из-за твоего исчезновения и попросил меня выяснить, что случилось. Ну разве у  меня был выбор отказаться? Бросить даму в беде - поступок недостойный капитана.";
			link.l1.go = "BetsiPrice_12";
			if (CheckAttribute(pchar, "questTemp.TBP_BuyKulonOtdatBetsy") && pchar.questTemp.TBP_BuyKulonOtdatBetsy == true)
            {
			link.l2 = "Я оказал"+GetSexPhrase("ся","ась")+" там не случайно. Меня привёл туда вот этот кулон. Держи. Трактирщик, кажется, всерьёз расстроился из-за твоего исчезновения и попросил меня выяснить, что случилось. Ну разве у  меня был выбор отказаться? Бросить даму в беде - поступок недостойный капитана.";
			link.l2.go = "BetsiPrice_12_otdal_kulon";
			}
		break;
		
		case "BetsiPrice_12":
			dialog.text = "Ах, это так благородно, капитан "+pchar.name+"! Что до трактирщика, то уверена, что он больше беспокоился о своей выручке, чем обо мне. Увы, пригласить тебя в гости сегодня не могу - нужно прийти в себя. Время, проведённое в подвале, вряд ли сделало меня ещё прекраснее. Но если мы не увидимся снова - этого я тебе не прощу. Так что приходи завтра в таверну, у меня будет для тебя... подарок.";
			link.l1 = "Что ж, теперь у меня есть ещё одна причина, чтобы туда заглянуть. До встречи, М... Бетси.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_ProvodimDoDoma_3");
		break;
		
		case "BetsiPrice_12_otdal_kulon":
			dialog.text = "Ах, это так благородно, капитан "+pchar.name+"! Что до трактирщика, то уверена, что он больше беспокоился о своей выручке, чем обо мне. Увы, пригласить тебя в гости сегодня не могу - нужно прийти в себя. Время, проведённое в подвале, вряд ли сделало меня ещё прекраснее. Но если мы не увидимся снова - этого я тебе не прощу. Так что приходи завтра в таверну, у меня будет для тебя... подарок.";
			link.l1 = "Что ж, теперь у меня есть ещё одна причина, чтобы туда заглянуть. До встречи, М... Бетси.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_ProvodimDoDoma_3");
			TakeItemFromCharacter(pchar, "jewelry24");
			ChangeCharacterComplexReputation(pchar,"nobility", 2);
		break;
		
		case "TBP_Helena_1":
			dialog.text = "Ну надо же... Какое милое прощание. Кто эта потрёпанная дамочка? Выглядит так, будто неделю просидела в подвале, но даже это не помешало тебе пожирать её глазами, да, "+pchar.name+"?";
			link.l1 = "Это не то, о чём ты подумала. Девушка оказалась в сложной ситуации, и я помог ей выбраться. Вот и всё.";
			link.l1.go = "TBP_Helena_2";
		break;
		
		case "TBP_Helena_2":
			dialog.text = "И ты, конечно же, решил стать её рыцарем в сияющих доспехах?";
			link.l1 = "Ты же знаешь, я не умею оставаться в стороне, когда кому-то грозит опасность.";
			link.l1.go = "TBP_Helena_3";
		break;
		
		case "TBP_Helena_3":
			dialog.text = "Хорошо. Но в следующий раз, "+pchar.name+", будь осторожнее... и не давай мне поводов для ревности.";
			link.l1 = "Конечно, милая. Пойдём отсюда, у нас ещё много дел.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_ProvodimDoDoma_5");
		break;
		
		case "TBP_Mary_1":
			dialog.text = "Ну надо же... Какое милое прощание. Такая забота, такие нежные обещания... Ты её даже по имени ласково называешь, да. Может, мне тоже исчезнуть на пару дней, чтобы ты искал меня с таким же рвением?";
			link.l1 = "Мэри, ты же знаешь, ты - мой ориентир, а она... просто девушка, попавшая в беду.";
			link.l1.go = "TBP_Mary_2";
		break;
		
		case "TBP_Mary_2":
			dialog.text = " Ах, ну конечно! Просто бедняжка, которой нужен рыцарь! А тот взгляд твой - тоже просто из вежливости? Да ты едва не раздел её глазами!";
			link.l1 = "Мэри, ты преувеличиваешь! Вот как я смотрю на тебя? Видишь разницу? Или мне придётся напомнить тебе... поближе?";
			link.l1.go = "TBP_Mary_3";
		break;
		
		case "TBP_Mary_3":
			dialog.text = "Ладно, "+pchar.name+", на этот раз ты выкрутился, да. Но если я ещё раз увижу такую сцену...";
			link.l1 = "То мне придётся ещё раз напомнить тебе, кто в моём сердце занимает первое и единственное место. Пойдём, дорогая, у нас ещё много дел.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_ProvodimDoDoma_5");
		break;
		
		case "BetsiPrice_sex_1":
		
			switch (rand(1))
			{
				case 0:
					dialog.text = "Ммм... Ты даже не представляешь, какие мысли крутятся у меня в голове, когда я так близко к тебе... И как сильно я хочу воплотить их в жизнь.";
					link.l1 = "Тогда перестань только думать об этом... и покажи мне каждую из них.";
					link.l1.go = "exit";
					NextDiag.TempNode = "OS_Matros_again";
				break;

				case 1:
					dialog.text = "Ах, дорог"+GetSexPhrase("ой","ая")+"... Ты даже не представляешь, как мне сложно держать себя в руках, когда ты рядом...";
					link.l1 = "Тогда хватит с тебя этой сладкой пытки... Иди ко мне...";
					link.l1.go = "exit";
					NextDiag.TempNode = "OS_Matros_again";
				break;
			}
			AddDialogExitQuestFunction("TBP_Betsi_sex_3");
		break;
		
		case "BetsiPrice_sex_2":
			switch (rand(1))
			{
				case 0:
					dialog.text = "Ах, "+GetSexPhrase("мой милый капитан","моя милая "+pchar.name+"")+", я до сих пор вся в этом сладком безумии.";
					link.l1 = "Пожалуй, это безумие стоит запомнить... или даже когда-нибудь повторить.";
					link.l1.go = "exit";
					NextDiag.TempNode = "OS_Matros_again";
				break;

				case 1:
					dialog.text = "Ох, "+pchar.name+"... Если я скажу, что это было потрясающе, ты ведь не станешь слишком самодовольн"+GetSexPhrase("ым","ой")+"?";
					link.l1 = "Только если ты пообещаешь сказать это ещё раз... шёпотом.";
					link.l1.go = "exit";
					NextDiag.TempNode = "OS_Matros_again";
				break;
			}
			AddDialogExitQuestFunction("TBP_Betsi_sex_7");
		break;
		
		
		
		
		
		
		
	}
}