void ProcessDialogEvent()
{
	ref NPChar, sld;
	aref Link, NextDiag;
	int i, iTemp;
	string sTemp;
	bool bOk1, bOk2;
	
	DeleteAttribute(&Dialog,"Links");
	
	makeref(NPChar,CharacterRef);
	makearef(Link, Dialog.Links);
	makearef(NextDiag, NPChar.Dialog);
	
	switch(Dialog.CurrentNode)
	{
		case "Exit":
			NextDiag.CurrentNode = NextDiag.TempNode;
			DialogExit();
		break;
		
		case "First time":
			dialog.text = "Что вам надо?";
			link.l1 = "Ничего.";
			link.l1.go = "exit";
		break;
		
		case "OZ_Kuznets_1":
			dialog.text = "Что вы хотели, "+GetAddress_Form(NPChar)+"? Простите, но новые заказы я не принимаю. У меня просто... много работы...";
			link.l1 = "Вот как? Говорят, недавно вы проиграли в карты что-то очень ценное, это правда?";
			link.l1.go = "OZ_Kuznets_2";
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Kuznets_2":
			dialog.text = "Что ж, если вы пришли позлорадствовать, становитесь в очередь - желающих и без вас хватает. Только вот ни один не предложил мне помощь. Моя судьба висит на волоске, и она всецело  зависит от Хавьера Кастильо, а людям лишь бы потешиться над моей неудачей.";
			link.l1 = "Я не из тех, кто смеётся над чужими бедами. Расскажите, как всё было. Возможно, я смогу вам помочь.";
			link.l1.go = "OZ_Kuznets_3";
			link.l2 = "Помощь? А с чего бы вам кто-то должен её оказывать? Я точно не стану. Вы сами кузнец своего счастья... и несчастья тоже. Так что хватит делать из себя жертву - просто примите последствия своих поступков, они более чем закономерны.";
			link.l2.go = "OZ_Kuznets_NoAgree";
		break;
		
		case "OZ_Kuznets_NoAgree":
			DialogExit();
			AddDialogExitQuestFunction("OZ_Kuznets_NoAgree");
		break;
		
		case "OZ_Kuznets_3":
			dialog.text = "Этот вечер не должен был стать роковым. Я просто зашёл в таверну, чтобы пропустить кружечку рома после того, как сам адмирал Эухенио де ла Торре сделал у меня крупный заказ. Но, изрядно охмелев, я сел за стол сыграть в карты. Тут-то за меня и взялся Хавьер\nСначала удача была на моей стороне - я даже выиграл приличную сумму, но стоило мне уверовать в своё везение, как ситуация круто изменилась. Хавьер всё подливал и подливал ром в мою кружку, а я раз за разом проигрывал: сначала я спустил все наличные, потом деньги, отложенные на материалы, а затем и все свои сбережения\nКогда я осознал, сколько уже проиграл, отступать было поздно. Я был одержим одной мыслью - отыграться любой ценой. И тогда я поставил на кон свою книгу. Этот мерзавец Хавьер оценил её всего в пять тысяч песо\nКонечно, она стоит гораздо больше, но я был настолько ослеплён азартом, что согласился. Ну, а дальше... Думаю, вам уже известно. Я проиграл. Знаете, со мной никогда такого не было. Мне кажется, что этот негодяй меня чем-то опоил.";
			link.l1 = "И чем же, позвольте узнать, я могу вам помочь? Вы ведь сами сели за стол, сами поставили на кон своё имущество и сами всё проиграли. Теперь вы просто не хотите смириться с последствиями? И чем так ценна эта книга, что её вы поставили в последнюю очередь?";
			link.l1.go = "OZ_Kuznets_4";
		break;
		
		case "OZ_Kuznets_4":
			dialog.text = "Эта книга - самое ценное, что у меня было. В ней находятся секреты, которые веками передавались мастерами от учителя к ученику. Она - сердце моей кузни, душа моего ремесла. С проигрышем я уже смирился, "+GetAddress_Form(NPChar)+", но как мне смириться с утратой книги? Я предложил Хавьеру выкуп за неё - пять тысяч песо\nЯ готов был влезть в долги, лишь бы её вернуть. Но знаете, что он сказал? Он сказал, что хочет за неё сто тысяч! Сто, "+GetAddress_Form(NPChar)+"! Таких денег у меня нет. А ни снизить цену, ни получить их частями, он не согласен. Я умолял его... но он только посмеялся надо мной. Я вижу, вы "+GetSexPhrase("человек бравый, моряк... а может, даже капитан. И оружие у вас не для красоты висит","девушка не простая, и подход к любому мужчине наверняка найти сможете")+"\nПрошу вас, поговорите с Хавьером. Возможно, он прислушается к вам, и согласится на отсрочку по выплате долга. Без этой книги... моя жизнь не имеет смысла. Взамен я смогу всегда продать вам качественные материалы по хорошей цене, когда встану на ноги, а может получится даже изготовить для вас что-то особенное, капитан.";
			link.l1 = "Что ж, поговорить - дело нехитрое. Посмотрим, что из этого выйдет. Но для начала позвольте представиться: меня зовут "+GetFullName(pchar)+", я капитан собственного судна.";
			link.l1.go = "OZ_Kuznets_5";
		break;
		
		case "OZ_Kuznets_5":
			dialog.text = ""+GetSexPhrase("А я Себастьян Кордоба...","Девушка - капитан собственного судна? Я слыхал о таких, но вот встретить лично и поговорить - не доводилось.")+" Рад знакомству, капитан "+pchar.lastname+". И спасибо вам. В наше время легче найти тех, кто глумится над чужим несчастьем, чем тех, кто готов помочь. Знаете, если моя книга всё же вернётся ко мне, клянусь: я больше никогда не стану играть в азартные игры.";
			link.l1 = "Пока благодарить меня не за что. Сначала я разберусь со своими делами, а потом уж, если останется время, поговорю с Хавьером.";
			link.l1.go = "OZ_Kuznets_6";
		break;
		
		case "OZ_Kuznets_6":
			dialog.text = "Боюсь, вы можете опоздать. Хавьер оказался куда проворнее, чем я думал\nОн уже нашёл покупателя для книги - это Этьен Ренуар, французский мастер оружейных дел. Если адмирал узнает, что по моей вине такая ценность оказалась в руках французов... мне не сносить головы. Тюрьма будет ещё лёгким наказанием.";
			link.l1 = "Хм... Ну хорошо. Займусь вашей проблемой немедленно.";
			link.l1.go = "exit";
			NextDiag.TempNode = "OZ_Kuznets_repeat";
			AddDialogExitQuestFunction("OZ_Kuznets_Agree");
		break;
		
		case "OZ_Kuznets_repeat":
			dialog.text = "Капитан "+ pchar.lastname +"! Вы поговорили с Хавьером? Какие новости?";
			link.l1 = "Пока нет, но я как раз направляюсь в таверну.";
			link.l1.go = "exit";
			NextDiag.TempNode = "OZ_Kuznets_repeat";
		break;
		
		case "OZ_Shuler_1":
			dialog.text = "Эй, "+GetSexPhrase("моряк","милашка")+", не хочешь испытать удачу в картишках? Присаживайся, ставки у нас тут щадящие... по крайней мере, для новичков.";
			link.l1 = "Сдаётся мне, ты именно тот, кого я ищу. Именно так ты зазывал Себастьяна, прежде чем ободрать его до нитки? Я здесь за его книгой.";
			link.l1.go = "OZ_Shuler_2";
		break;
		
		case "OZ_Shuler_2":
			dialog.text = "Что ж, отлично.  Давай сто тысяч - и можешь забрать её. Мне от этой книги проку никакого, я даже щипцы от молотка не отличу.";
			link.l1 = "Я дам тебе пять тысяч - ты сам назначил эту цену, когда обыгрывал кузнеца.";
			link.l1.go = "OZ_Shuler_3";
		break;
		
		case "OZ_Shuler_3":
			dialog.text = "Ха! Ты что, за дурака меня держишь? Мне прекрасно известна настоящая ценность этой книги. Сто тысяч, и ни монетой меньше. Или же она отправится к французам - у них с деньжатами нет проблем.";
			link.l1 = "Ты думаешь, власти закроют глаза на то, что ты собираешься продать французам испанские чертежи? Адмирал будет в ярости, когда об этом узнает.";
			link.l1.go = "OZ_Shuler_4";
		break;
		
		case "OZ_Shuler_4":
			dialog.text = "Ох, да брось. Властям плевать на какую-то там книгу, у них забот хватает и без этого. А адмирал? Да, он французов всем сердцем ненавидит, но дожидаться его я не собираюсь - с такой кучей денег я стану желанным гостем в любой колонии Нового Света.";
			link.l1 = "Тогда давай договоримся. Ты получишь свои деньги, но не сразу. Кузнец будет выплачивать долг частями, а книга сегодня же возвращается к нему под залог моей капитанской чести. Для тебя это ничего не меняет - он всё равно расплатится, а ты не теряешь ни песо.";
			link.l1.go = "OZ_Shuler_5";
		break;
		
		case "OZ_Shuler_5":
			dialog.text = "Кажется, ты меня не слышишь. Я же ясно дал понять - деньги нужны мне прямо сейчас. Ни через неделю, ни через месяц, или когда там кузнец их наскребёт, а прямо сейчас. Я собираюсь убраться с этого несчастного острова, как можно быстрее. Поэтому либо вся сумма сейчас окажется у меня на руках, либо книга отправляется к французам, а ты свою капитанскую честь будешь закладывать адмиральскому палачу.";
			link.l1 = "Давай так: сыграем. Мои сто тысяч против книги. Если ты выиграешь, покинешь остров богачом. Если проиграешь - я забираю книгу. Или ты играешь только с теми, кто карты первый раз видит?";
			link.l1.go = "OZ_Shuler_6";
		break;
		
	}
}