void ProcessDialogEvent()
{
	ref NPChar, sld;
	aref Link, NextDiag;
	int i, iTemp;
	string sTemp;
	bool bOk1, bOk2;
	
	DeleteAttribute(&Dialog,"Links");
	
	makeref(NPChar,CharacterRef);
	makearef(Link, Dialog.Links);
	makearef(NextDiag, NPChar.Dialog);
	
	switch(Dialog.CurrentNode)
	{
		case "Exit":
			NextDiag.CurrentNode = NextDiag.TempNode;
			DialogExit();
		break;
		
		case "First time":
			dialog.text = "Что вам надо?";
			link.l1 = "Ничего.";
			link.l1.go = "exit";
		break;
		
		case "OZ_Kuznets_1":
			PlaySound("VOICE\Russian\Master_05.wav");
			dialog.text = "Что вы хотели, "+GetAddress_Form(NPChar)+"? Простите, но новые заказы я не принимаю. У меня просто... много работы...";
			link.l1 = "Вот как? Говорят, недавно вы проиграли в карты что-то очень ценное, это правда?";
			link.l1.go = "OZ_Kuznets_2";
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Kuznets_2":
			dialog.text = "Что ж, если вы пришли позлорадствовать, становитесь в очередь - желающих и без вас хватает. Только вот ни один не предложил мне помощь. Моя судьба висит на волоске, и она всецело  зависит от Хавьера Кастильо, а людям лишь бы потешиться над моей неудачей.";
			link.l1 = "Я не из тех, кто смеётся над чужими бедами. Расскажите, как всё было. Возможно, я смогу вам помочь.";
			link.l1.go = "OZ_Kuznets_3";
			link.l2 = "Помощь? А с чего бы вам кто-то должен её оказывать? Я точно не стану. Вы сами кузнец своего счастья... и несчастья тоже. Так что хватит прикидываться жертвой - просто примите последствия своих поступков, они более чем закономерны.";
			link.l2.go = "OZ_Kuznets_NoAgree";
		break;
		
		case "OZ_Kuznets_NoAgree":
			DialogExit();
			AddDialogExitQuestFunction("OZ_Kuznets_NoAgree");
		break;
		
		case "OZ_Kuznets_3":
			dialog.text = "Этот вечер не должен был стать роковым. Я просто зашёл в таверну, чтобы пропустить кружечку рома после того, как сам адмирал Эухенио де ла Торре сделал у меня крупный заказ. Но, изрядно охмелев, я сел за стол сыграть в карты. Тут-то за меня и взялся Хавьер\nСначала удача была на моей стороне - я даже выиграл приличную сумму, но стоило мне уверовать в своё везение, как ситуация круто изменилась. Хавьер всё подливал и подливал ром в мою кружку, а я раз за разом проигрывал: сначала я спустил все наличные, потом деньги, отложенные на материалы, а затем и все свои сбережения\nКогда я осознал, сколько уже проиграл, отступать было поздно. Я был одержим одной мыслью - отыграться любой ценой. И тогда я поставил на кон свою книгу. Этот мерзавец Хавьер оценил её всего в пять тысяч песо\nКонечно, она стоит гораздо больше, но я был настолько ослеплён азартом, что согласился. Ну, а дальше... Думаю, вам уже известно. Я проиграл. Знаете, со мной никогда такого не было. Мне кажется, что этот негодяй меня чем-то опоил.";
			link.l1 = "И чем же, позвольте узнать, я могу вам помочь? Вы ведь сами сели за стол, сами поставили на кон своё имущество и сами всё проиграли. Теперь вы просто не хотите смириться с последствиями? И чем же так ценна эта книга, из-за которой вы так сокрушаетесь?";
			link.l1.go = "OZ_Kuznets_4";
		break;
		
		case "OZ_Kuznets_4":
			dialog.text = "Эта книга - самое ценное, что у меня было. В ней находятся секреты, которые веками передавались мастерами от учителя к ученику. Она - сердце моей кузни, душа моего ремесла. С проигрышем я уже смирился, "+GetAddress_Form(NPChar)+", но как мне смириться с утратой книги? Я предложил Хавьеру выкуп за неё - пять тысяч песо\nЯ готов был влезть в долги, лишь бы её вернуть. Но знаете, что он сказал? Он сказал, что хочет за неё сто тысяч! Сто, "+GetAddress_Form(NPChar)+"! Таких денег у меня нет. А ни снизить цену, ни получить их частями, он не согласен. Я умолял его... но он только посмеялся надо мной. Я вижу, вы "+GetSexPhrase("человек бравый, моряк... а может, даже капитан. И оружие у вас не для красоты висит","девушка не простая, и подход к любому мужчине наверняка найти сможете")+"\nПрошу вас, поговорите с Хавьером. Возможно, он прислушается к вам, и согласится на отсрочку по выплате долга. Без этой книги... моя жизнь не имеет смысла. Взамен я смогу всегда продать вам качественные материалы по хорошей цене, когда встану на ноги, а может получится даже изготовить для вас что-то особенное, капитан.";
			link.l1 = "Что ж, поговорить - дело нехитрое. Посмотрим, что из этого выйдет. Но для начала позвольте представиться: меня зовут "+GetFullName(pchar)+", я капитан собственного судна.";
			link.l1.go = "OZ_Kuznets_5";
		break;
		
		case "OZ_Kuznets_5":
			dialog.text = ""+GetSexPhrase("А я Себастьян Кордоба...","Девушка - капитан собственного судна? Я слыхал о таких, но вот встретить лично и поговорить - не доводилось.")+" Рад знакомству, капитан "+pchar.lastname+". И спасибо вам. В наше время легче найти тех, кто глумится над чужим несчастьем, чем тех, кто готов помочь. Знаете, если моя книга всё же вернётся ко мне, клянусь: я больше никогда не стану играть в азартные игры.";
			link.l1 = "Пока благодарить меня не за что. Сначала я разберусь со своими делами, а потом уж, если останется время, поговорю с Хавьером.";
			link.l1.go = "OZ_Kuznets_6";
		break;
		
		case "OZ_Kuznets_6":
			dialog.text = "Боюсь, вы можете опоздать. Хавьер оказался куда проворнее, чем я думал\nОн уже нашёл покупателя для книги - это Этьен Ренуар, французский мастер оружейных дел. Если адмирал узнает, что по моей вине такая ценность оказалась в руках французов... мне не сносить головы. Тюрьма будет ещё лёгким наказанием.";
			link.l1 = "Хм... Ну хорошо. Займусь вашей проблемой немедленно.";
			link.l1.go = "exit";
			NextDiag.TempNode = "OZ_Kuznets_repeat";
			AddDialogExitQuestFunction("OZ_Kuznets_Agree");
		break;
		
		case "OZ_Kuznets_repeat":
			dialog.text = "Капитан "+ pchar.lastname +"! Вы поговорили с Хавьером? Какие новости?";
			link.l1 = "Пока нет, но я как раз направляюсь в таверну.";
			link.l1.go = "exit";
			NextDiag.TempNode = "OZ_Kuznets_repeat";
			if (CheckCharacterItem(PChar, "OZ_book"))
			{
				link.l1 = "Поговорил"+GetSexPhrase("","а")+". И весьма удачно. Хавьер поспешно отправился в мир иной, но перед этим успел вернуть вашу книгу. Держите.";
				link.l1.go = "OZ_Kuznets_11";
				DelLandQuestMark(npchar);
			}
		break;
		
		case "OZ_Kuznets_11":
			dialog.text = ""+UpperFirst(GetAddress_Form(NPChar))+", вы даже не представляете, что это для меня значит! Благодаря вам я смогу выполнить все заказы, и даже работу для самого адмирала! Денег у меня, к сожалению, нет, но я всё же подготовил для вас награду\nВот, возьмите эту кирасу - я изготовил её для одного дона, но, уверен, он сможет немного подождать. А ещё у меня есть кое-какие материалы, они вам пригодятся, если решите создать что-то своими руками.";
			link.l1 = "Спасибо, "+npchar.name+", вы очень щедры!";
			link.l1.go = "OZ_Kuznets_12";
			TakeItemFromCharacter(pchar, "OZ_book");
		break;
		
		case "OZ_Kuznets_12":
			dialog.text = "И ещё, заглядывайте ко мне, если вам понадобятся материалы. Поставки у меня раз в месяц, так что и для вас всегда найдётся что-то полезное - да ещё и по хорошей цене. Я держу свои обещания.";
			link.l1 = "Обязательно загляну! Ну, "+npchar.name+", бывайте здоровы. А я пойду, дела.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_Kuznets_Nagrada");
			GiveItem2Character(PChar, "cirass3");
			AddItems(PChar, "jewelry13", 10);
			AddItems(PChar, "jewelry12", 5);
			AddItems(PChar, "jewelry10", 5);
			AddItems(PChar, "jewelry11", 2);
			AddQuestRecordInfo("Useful_Acquaintances", "7");
		break;
		
		case "OZ_Kuznets_Fail":
			dialog.text = "Капитан "+ pchar.lastname +"! Вы поговорили с Хавьером? Какие новости?";
			link.l1 = "Видите ли... книга была в моих руках. Но... обстоятельства сложились так, что она была продана.";
			link.l1.go = "OZ_Kuznets_Fail_2";
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Kuznets_Fail_2":
			dialog.text = "Что?! Вы... вы её продали?! Мою книгу?!";
			link.l1 = "Книгу, которую вы проиграли в карты. Она продана тому французу, которому её пообещал Хавьер.";
			link.l1.go = "OZ_Kuznets_Fail_3";
		break;
		
		case "OZ_Kuznets_Fail_3":
			dialog.text = "Но... мне ведь теперь конец. Книга у французов, заказ адмирала не будет выполнен... моя жизнь разрушена... Я... я обречён!";
			link.l1 = "Вы сами загнали себя в этот угол. Думаю, это послужит вам хорошим уроком. Прощайте.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_Kuznets_Fail");
			ChangeCharacterComplexReputation(pchar, "nobility", -3);
		break;
		
		case "OZ_Shuler_1":
			PlaySound("Voice\Russian\tavern\Igroki v Tavernah-06.wav"); 
			dialog.text = "Эй, "+GetSexPhrase("моряк","милашка")+", не хочешь испытать удачу в картишках? Присаживайся, ставки у нас тут щадящие... по крайней мере, для новичков.";
			link.l1 = "Сдаётся мне, ты именно тот, кого я ищу. Именно так ты зазывал Себастьяна, прежде чем ободрать его до нитки? Я здесь, чтобы вернуть ему его книгу.";
			link.l1.go = "OZ_Shuler_2";
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Shuler_2":
			dialog.text = "Что ж, отлично. Давай сто тысяч - и можешь забрать её. Мне от этой книги проку никакого, я даже щипцы от молотка не отличу.";
			link.l1 = "Я дам тебе пять тысяч - ты сам назначил эту цену, когда обыгрывал кузнеца.";
			link.l1.go = "OZ_Shuler_3";
		break;
		
		case "OZ_Shuler_3":
			dialog.text = "Ха! Ты что, за дурака меня держишь? Мне прекрасно известна настоящая ценность этой книги. Сто тысяч, и ни монетой меньше. Или же она отправится к французам - у них с деньжатами нет проблем.";
			link.l1 = "Ты думаешь, власти закроют глаза на то, что ты собираешься продать французам испанские чертежи? Адмирал будет в ярости, когда об этом узнает.";
			link.l1.go = "OZ_Shuler_4";
		break;
		
		case "OZ_Shuler_4":
			dialog.text = "Ох, да брось. Властям плевать на какую-то там книжонку, у них забот хватает и без этого. А адмирал? Да, он французов всем сердцем ненавидит, но дожидаться его я не собираюсь - с такой кучей денег я стану желанным гостем в любой колонии Нового Света.";
			link.l1 = "Тогда давай договоримся. Ты получишь свои деньги, но не сразу. Кузнец будет выплачивать долг частями, а книга сегодня же возвращается к нему под залог моей капитанской чести. Для тебя это ничего не меняет - он всё равно расплатится, а ты не теряешь ни песо.";
			link.l1.go = "OZ_Shuler_5";
		break;
		
		case "OZ_Shuler_5":
			dialog.text = "Кажется, ты меня не слышишь. Я же ясно дал понять - деньги нужны мне прямо сейчас. Ни через неделю, ни через месяц, или когда там кузнец их наскребёт, а прямо сейчас. Я собираюсь убраться с этого несчастного острова, как можно быстрее. Поэтому либо вся сумма сейчас окажется у меня на руках, либо книга отправляется к французам, а ты свою капитанскую честь будешь закладывать адмиральскому палачу.";
			if (sti(pchar.Money) >= 100000 && GetSummonSkillFromName(pchar, SKILL_SNEAK) >= 30)
			{
				link.l1 = "Давай так: сыграем. Мои сто тысяч против книги. Если ты выиграешь, покинешь остров богачом. Если проиграешь - я забираю книгу. Или ты играешь только с теми, кто карты первый раз видит?";
				link.l1.go = "OZ_Shuler_6";
			}
			else
			{
				link.l1 = "...";
				link.l1.go = "OZ_Shuler_6_No_Money";
				AddDialogExitQuestFunction("OZ_GameCards_Fail");
			}
		break;
		
		case "OZ_Shuler_6_No_Money":
			DialogExit();
			Notification_Money(false, 100000, "peso");
			LAi_CharacterDisableDialog(npchar);
			if (GetSummonSkillFromName(pchar, SKILL_SNEAK) >= 30)
			{
			Notification_Skill(true, 30, SKILL_SNEAK);
			}
			else
			{
			Notification_Skill(false, 30, SKILL_SNEAK);
			}
		break;
		
		case "OZ_Shuler_6":
			dialog.text = "Ха! Мне не нужно становиться богачом - я уже в богач! Зачем мне рисковать тем, что принесёт мне кучу денег?";
			link.l1 = "Ну надо же, сам Хавьер Кастильо боится сыграть? А я-то думал"+GetSexPhrase("","а")+", ты матёрый игрок, а не просто жулик, наживающийся на пьяных простаках.";
			link.l1.go = "OZ_Shuler_7";
			Notification_Money(true, 100000, "peso");
			Notification_Skill(true, 30, SKILL_SNEAK);
		break;
		
		case "OZ_Shuler_7":
			dialog.text = "Я не боюсь, просто не вижу смысла садиться за стол , когда у меня уже есть всё, что нужно.";
			link.l1 = "Да брось, я же вижу, как тебя трясёт от одной мысли сыграть с тем, кто не первый раз карты в руках держит. Дай угадаю, ты так спешишь убраться отсюда, потому что тебе стыдно? Все уже поняли, что противника сильнее пьяного простака тебе не одолеть?";
			link.l1.go = "OZ_Shuler_8";
		break;
		
		case "OZ_Shuler_8":
			dialog.text = "Да как ты смеешь? Я обыгрывал таких людей, которые с тобой за один стол не сядут! У нас банк бывал такой, что можно было купить по кораблю и по такому наглому капитану каждому! Играем. По пять тысяч за карту, у каждого по сто тысяч, у кого закончились деньги - тот и проиграл. Посмотрим, кто кого.";
			link.l1 = "Меньше слов, больше дела. Раздавай.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_GameCards");
		break;
		
		case "OZ_Shuler_Win_1":
			dialog.text = "Дьявол! Этого не может быть...";
			link.l1 = "Что, не так весело, когда выигрывает кто-то другой?";
			link.l1.go = "OZ_Shuler_Win_2";
		break;
		
		case "OZ_Shuler_Win_2":
			dialog.text = "Да ты жулик! Думаешь я ничего не видел? Чёрта с два я позволю тебе себя облапошить! Скорее я порублю тебя на куски.";
			link.l1 = "Жулик? Ха-ха! Похоже, ты просто не умеешь проигрывать, приятель. Но раз ты так спешишь отправиться на тот свет - я тебе в этом помогу. К оружию!";
			link.l1.go = "exit";
			pchar.questTemp.OZ_Draka = true;
			AddDialogExitQuestFunction("OZ_GameCards_Duel");
		break;
		
		case "OZ_Shuler_Lose_1":
			dialog.text = "Ха! Ну что, "+GetSexPhrase("приятель","милашка")+", каково это - чувствовать себя обобранн"+GetSexPhrase("ым","ой")+"? Говорят, наглость - второе счастье, но не в твоём случае.";
			link.l1 = "Не обольщайся. Тебе просто повезло.";
			link.l1.go = "OZ_Shuler_Lose_2";
		break;
		
		case "OZ_Shuler_Lose_2":
			dialog.text = "Неудачники всегда так говорят. Ладно, сыграл"+GetSexPhrase("","а")+" - проиграл"+GetSexPhrase("","а")+", не обижайся. Если вдруг найдёшь ещё сотню тысяч, можешь попытать счастье снова... Но, едва ли результат изменится...";
			link.l1 = "...";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_GameCards_Lose");
			AddLandQuestMark(characterFromId("PortSpein_Tavern"), "questmarkmain");
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Felip_1":
			dialog.text = "Здравствуйте "+GetAddress_Form(NPChar)+". Чем обязан вашему визиту?";
			link.l1 = "Приветствую. Я капитан "+GetFullName(pchar)+", и я хочу поговорить с вами о Хавьере Кастильо.";
			link.l1.go = "OZ_Felip_2";
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Felip_2":
			dialog.text = "Хм... Если этот пройдоха задолжал и вам, то боюсь, вам придётся встать в длинную очередь. Хавьер никогда не торопился с выплатой займов. Но если он и разживётся деньгами, в первую очередь он расплатится со мной - я уже позаботился о том, чтобы у него не осталось другого выбора.";
			link.l1 = "К счастью, я не являюсь его кредитором. Сколько же он вам задолжал? И какие именно меры вы предприняли?";
			link.l1.go = "OZ_Felip_3";
		break;
		
		case "OZ_Felip_3":
			dialog.text = "Вся сумма его долга - сто пятьдесят тысяч песо. Он выплатил всего десять тысяч, видимо, решив, что на этом можно остановиться. Но я быстро дал ему понять, что он ошибся. Мои люди выбили из него ещё двадцать тысяч. Остальное же он должен вернуть в течение недели, и срок вот-вот выйдет. К счастью, я слышал, что скоро он получит хорошую сумму от продажи какой-то книги.";
			link.l1 = "Вы действительно думаете, что он собирается вернуть вам деньги? Не думаю, что вам стоит всерьёз на это рассчитывать. Хавьер даже не скрывает того, что, как только он получит деньги, сразу же сбежит отсюда.";
			link.l1.go = "OZ_Felip_4";
		break;
		
		case "OZ_Felip_4":
			dialog.text = "Мне это известно, капитан. Уверяю вас, я уже позаботился о том, чтобы он не смог сбежать, не расплатившись со мной.";
			link.l1 = "Вижу, вы держите ситуацию под контролем. Однако, как показывает практика, перестраховка никогда не бывает лишней. Видите ли, я как раз специалист"+GetSexPhrase("","ка")+" по взысканию долгов. Если вы позволите мне действовать от вашего имени, я смогу вернуть вам ваши деньги.";
			link.l1.go = "OZ_Felip_5";
		break;
		
		case "OZ_Felip_5":
			dialog.text = "Увы, капитан, возврат этого долга уже обходится мне слишком дорого, и я не могу позволить себе оплачивать ещё и ваши услуги...";
			link.l1 = ""+UpperFirst(GetAddress_Form(NPChar))+", об этом можете не беспокоиться. В этом деле у меня есть свой интерес, а потому, я помогу вам безвозмездно.";
			link.l1.go = "OZ_Felip_6";
		break;
		
		case "OZ_Felip_6":
			dialog.text = "Позвольте узнать, в чём же именно ваш интерес?";
			link.l1 = "Скажем так, некоторые его проделки за карточным столом я не могу оставить безнаказанными.";
			link.l1.go = "OZ_Felip_7";
		break;
		
		case "OZ_Felip_7":
			dialog.text = "Что ж, если мне это ничего не будет стоить, не вижу причин отказываться. Единственное, капитан, прошу вас не заходить слишком далеко. Если этот мерзавец отправится к праотцам раньше, чем вернёт долг, мне от этого не будет никакой пользы.";
			link.l1 = "Не волнуйтесь, Фелипе, я буду действовать осторожно.";
			link.l1.go = "exit";
			NextDiag.TempNode = "OZ_Felip_again";
			AddDialogExitQuestFunction("OZ_Felip_2");
			pchar.questTemp.OZ_Dolg = true;
		break;
		
		case "OZ_Felip_again":
			dialog.text = ""+UpperFirst(GetAddress_Form(NPChar))+"! Не уж то вы справились так быстро?";
			link.l1 = "К сожалению, пока нет. Но я работаю над этим.";
			link.l1.go = "exit";
			NextDiag.TempNode = "OZ_Felip_again";
		break;
		
		case "OZ_Shuler_11":
			if (CheckAttribute(npchar, "quest.OZ_Shuler_Lose"))
			{
				dialog.text = "А, "+GetSexPhrase("капитан","милашка")+"-выскочка! Опять ты? Что, хочешь ещё пару тысяч проиграть?";
			}
			else
			{
				dialog.text = "Опять ты? Я же ясно сказал: деньги на стол - или проваливай.";
			}
			link.l1 = "Тон смени, Хавьер. И кошелёк доставай - я здесь не просто так. Ты ведь не забыл о своём долге Фелипе Аларкону? Теперь я представляю его интересы. Так что выбирай: либо ты прямо сейчас отдаёшь долг, либо мне придётся поискать деньги в твоих карманах после того, как ты отправишься к праотцам.";
			link.l1.go = "OZ_Shuler_12";
			DelLandQuestMark(npchar);
		break;
		
		case "OZ_Shuler_12":
			dialog.text = "Чёрт бы тебя побрал! У меня сделка, не видишь? Возвращайся через пару часов - тогда и поговорим.";
			link.l1 = "Кажется, ты меня не слышал. Я же ясно дал"+GetSexPhrase("","а")+" понять - деньги нужны мне прямо сейчас. Не через неделю, не через месяц, или когда там ты их наскребёшь, а прямо сейчас. Сто двадцать тысяч песо и ни монетой меньше. Книгу я готов принять в качестве пяти тысяч.";
			link.l1.go = "OZ_Shuler_13";
		break;
		
		case "OZ_Shuler_13":
			dialog.text = ""+GetSexPhrase("Грязный ублюдок","Ах ты дрянь")+"! Если ты думаешь, что сможешь легко со мной разделаться - это самая большая ошибка в твоей никчёмной жизни.";
			link.l1 = "Посмотрим.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_Shuler_Bitva");
		break;
		
		case "OZ_Frantsuz_1":
			PlaySound("VOICE\Russian\tra_quest_1.wav");
			if (CheckAttribute(pchar, "questTemp.OZ_Draka"))
			{
				dialog.text = "Что за зрелище... Признаюсь, "+GetAddress_Form(NPChar)+", вы доставили мне удовольствие. Вы превосходно владеете клинком. Позвольте представиться - "+GetFullName(npchar)+". А этот несчастный, как я понимаю, Хавьер Кастильо?";
				link.l1 = "Именно так, это он. А я - капитан "+GetFullName(pchar)+".";
				link.l1.go = "OZ_Frantsuz_1_1";
			}
			else
			{
				dialog.text = "Что за зрелище... Признаюсь, "+GetAddress_Form(NPChar)+", вы доставили мне удовольствие. Вы превосходно владеете клинком. Забавно, как порой складываются обстоятельства - книга, ради которой я проделал столь долгий путь, сменила хозяина самым неожиданным образом. Но, надеюсь, я всё же не уеду отсюда с пустыми руками.";
				link.l1 = "Хм... И во сколько же вы оцениваете эту книгу?";
				link.l1.go = "OZ_Frantsuz_2";
			}
		break;
		
		case "OZ_Frantsuz_1_1":
			dialog.text = "Видите ли, капитан, я преодолел немалое расстояние ради одной книги... И, похоже, теперь она в ваших руках. Искренне надеюсь, что мы с вами сможем прийти к соглашению - не хотелось бы покидать это место с пустыми руками.";
			link.l1 = "Хм... И во сколько же вы оцениваете эту книгу?";
			link.l1.go = "OZ_Frantsuz_2";
		break;
		
		case "OZ_Frantsuz_2":
			dialog.text = "О, "+GetAddress_Form(NPChar)+", я знаю цену по-настоящему редким вещам. Восемьдесят тысяч песо. Сумма более чем щедрая, и, поверьте, вряд ли вы получите подобное предложение ещё раз.";
			link.l1 = "Что ж, книга действительно ценная, и признаюсь, я спросил"+GetSexPhrase("","а")+" исключительно любопытства ради. Я не собираюсь торговать судьбой человека. Увы, месье, сделки не будет - эта книга должна вернуться к своему владельцу.";
			link.l1.go = "OZ_Frantsuz_3";
			link.l2 = "Смешная сумма. В этой книге собраны секреты лучших мастеров кузнечного дела. Сто пятьдесят тысяч песо - либо вы соглашаетесь, либо она возвращается своему владельцу. Торга не будет.";
			link.l2.go = "OZ_Frantsuz_4";
		break;
		
		case "OZ_Frantsuz_3":
			dialog.text = "Прошу вас, не спешите отказываться. Я проделал немалый путь ради неё. Я готов предложить вам сто тысяч, исключительно в знак уважения к мастерству, с которым вы управились с этим человеком.";
			link.l1 = "Я всё сказал. За сим - прошу простить, мне пора.";
			link.l1.go = "OZ_Frantsuz_4_1";
		break;
		
		case "OZ_Frantsuz_4_1":
			DialogExit();
			AddDialogExitQuestFunction("OZ_Frantsuz_1");
			ChangeCharacterComplexReputation(pchar, "nobility", 2);
			ChangeCharacterNationReputation(pchar, SPAIN, 10);
		break;
		
		case "OZ_Frantsuz_4":
			dialog.text = ""+UpperFirst(GetAddress_Form(NPChar))+", я ценю вашу уверенность, но сто пятьдесят тысяч - это уже не цена, это абсурд. Давайте не будем превращать сделку в фарс. Сто тысяч песо - это разумная сумма, соглашайтесь, никто за эту книгу не даст больше.";
			link.l1 = "Похоже, мы не нашли общего языка. Что ж, не вижу смысла продолжать этот разговор. Всего доброго, месье.";
			link.l1.go = "OZ_Frantsuz_5";
		break;
		
		case "OZ_Frantsuz_5":
			dialog.text = "Погодите! Хорошо, вы победили. Сто пятьдесят тысяч. По рукам?";
			link.l1 = "Рад что вы сделали правильный выбор. Книга ваша. Думаю, с ней вы станете лучшим мастером на карибах.";
			link.l1.go = "OZ_Frantsuz_6";
			TakeItemFromCharacter(pchar, "OZ_book");
			AddMoneyToCharacter(pchar, 150000);
			ChangeCharacterNationReputation(pchar, FRANCE, 10);
			ChangeCharacterNationReputation(pchar, SPAIN, -10);
			ChangeCharacterReputation(pchar, -5);
		break;
		
		case "OZ_Frantsuz_6":
			dialog.text = ""+UpperFirst(GetAddress_Form(NPChar))+", даже без этой книги мне не было равных. Но, признаюсь, приятно заполучить столь редкий трофей. А теперь прошу меня простить - мне не терпится проверить, действительно ли она стоит тех восторженных слов, что я о ней слышал.";
			link.l1 = "Что ж, тогда не смею вас задерживать. Всего доброго.";
			link.l1.go = "OZ_Frantsuz_7";
		break;
		
		case "OZ_Frantsuz_7":
			DialogExit();
			AddDialogExitQuestFunction("OZ_Frantsuz_2");
		break;
		
		case "OZ_Bandit_1":
			if (pchar.sex == "man")
			{
				dialog.text = "Ба, а это ещё что за шваль?  Думал, наш сундук обчистить и делать ноги? Ошибочка, приятель. Сейчас мы тебя самого в этот сундук сложим, да крышку наглухо забьём!";
			}
			else
			{
				dialog.text = " Так-так... И кто это у нас тут? Ты не заблудилась, крошка? Думала сундук обчистить и тихонько улизнуть? Ошибочка, дорогуша. Сейчас мы тебя как следует обыщем - да посмотрим, что у тебя там в карманах... и не только.";
			}
			link.l1 = "Слишком много слов, для жалких червяков вроде вас. Доставайте свои железки, посмотрим, чего вы стоите на деле.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_Grot_4");
		break;
		
		case "OZ_Felip_11":
			dialog.text = "Капитан! Мне уже доложили, что Хавьер отправился на тот свет по вашей милости. А ведь я просил не убивать его раньше времени! Надеюсь, вы здесь, чтобы вернуть мне мои деньги?";
			if (sti(pchar.Money) >= 100000)
			{
				link.l1 = "Именно так. Мне удалось найти его схрон, в котором было сто тысяч песо. Это все деньги, которые у него были.";
				link.l1.go = "OZ_Felip_12";
			}
			link.l2 = "Да, мне пришлось убить его. Но он сам набросился, и мне пришлось защищаться. В  его карманах оказалось пусто - ни гроша. Увы, вернуть долг так и не удалось.";
			link.l2.go = "OZ_Felip_14";
			DelLandQuestMark(npchar);
			DeleteAttribute(pchar, "questTemp.OZ_Dolg");
		break;
		
		case "OZ_Felip_12":
			dialog.text = "Сто тысяч... Конечно, это не вся сумма, но, зная Хавьера, сомневаюсь, что кто-то смог бы вытрясти из него больше. Что ж, спасибо вам, капитан. Похоже, я нанял не тех людей. Вы действительно мастер своего дела.";
			link.l1 = "Это было не трудно. На этом, вынужден"+GetSexPhrase("","а")+" с вами распрощаться. Дела ждут.";
			link.l1.go = "OZ_Felip_13";
			AddMoneyToCharacter(pchar, -100000);
		break;
		
		case "OZ_Felip_13":
			dialog.text = "До свидания, капитан.";
			link.l1 = "...";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_Felip_good");
		break;
		
		case "OZ_Felip_14":
			dialog.text = "Ах ты, мерзав"+GetSexPhrase("ец","ка")+"! Лжёшь мне, глядя прямо в глаза?! Это не сойдёт тебе с рук!";
			link.l1 = "Аргх...";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("OZ_Felip_bad");
		break;
		
		case "OZ_Kuznets_Tovar":
			PlaySound("VOICE\Russian\Master_02.wav");
			//PlaySound("VOICE\Spanish\Master_02.wav");
			dialog.text = "Здравствуйте, "+pchar.name+"! Желаете приобрести материалы или изделия?";
			link.l1 = ""+TimeGreeting()+". Давайте посмотрим, что у вас есть.";
			link.l1.go = "OZ_Kuznets_Tovar_2";
			link.l2 = "И вам здравствуйте, "+npchar.name+"! Благодарю за предложение, но я просто хотел"+GetSexPhrase("","а")+" поздороваться.";
			link.l2.go = "exit";
			NextDiag.TempNode = "OZ_Kuznets_Tovar_repeat";
			SetFunctionTimerCondition("OZ_Kuznets_Reset", 0, 0, 1, false);
			if (!CheckAttribute(npchar, "quest.OZ_Kuznets_tovar")) 
			{
				SetFunctionTimerCondition("OZ_Kuznets_Reset_2", 0, 0, 30, false);
				npchar.quest.OZ_Kuznets_tovar = true;
			}
		break;
		
		case "OZ_Kuznets_Tovar_repeat":
			dialog.text = ""+UpperFirst(GetAddress_Form(NPChar))+", вы решили всё таки что-нибудь приобрести?";
			link.l1 = "Именно так. Покажите, что у вас есть сегодня.";
			link.l1.go = "OZ_Kuznets_Tovar_2";
			link.l2 = "Увы, уже ухожу.";
			link.l2.go = "exit";
			NextDiag.TempNode = "OZ_Kuznets_Tovar_repeat";
		break;
		
		case "OZ_Kuznets_Tovar_2":
			DialogExit();
			LaunchItemsTrade(NPChar, 0);
			NextDiag.CurrentNode = "OZ_Kuznets_Tovar_repeat";
		break;
		
	}
}