void ProcessDialogEvent()
{
	ref NPChar, sld;
	aref Link, NextDiag;
	int i, iTemp;
	string sTemp;
	
	DeleteAttribute(&Dialog,"Links");
	
	makeref(NPChar,CharacterRef);
	makearef(Link, Dialog.Links);
	makearef(NextDiag, NPChar.Dialog);
	
	switch(Dialog.CurrentNode)
	{
		case "Exit":
			NextDiag.CurrentNode = NextDiag.TempNode;
			DialogExit();
		break;
		
		case "First time":
			dialog.text = "Что вам надо?";
			link.l1 = "Ничего.";
			link.l1.go = "exit";
		break;
		
		case "Juli":
			dialog.text = "...";
			if (pchar.sex == "woman")
			{
				link.l1 = "Мадемуазель, говорят, Порт-о-Пренс теряет своё очарование, когда вы не улыбаетесь. Сегодня, похоже, именно такой день. Простите за прямоту, но что-то вас тревожит?";
			}
			else
			{
				link.l1 = "Мадемуазель, я наслышан о вашей красоте и обаянии, и должен признать - слухи нисколько не преувеличивают. Но говорят также, что Порт-о-Пренс теряет своё очарование, когда вы не улыбаетесь. Сегодня, увы, похоже, именно такой день. Назовите имя негодяя, осмелившегося омрачить ваш день, и, клянусь, я вызову его на дуэль, чтобы вернуть улыбку на ваше прекрасное личико.";
			}
			link.l1.go = "Juli_2";
			DelLandQuestMark(npchar);
		break;
		
		case "Juli_2":
			if (pchar.sex == "woman")
			{
				dialog.text = "Ах, мадемуазель, вы слишком внимательны... Признаюсь, ваша забота тронула меня. Но, увы, причина моего беспокойства не из тех, что можно развеять лёгкой беседой. Это не чья-то вина, а лишь обстоятельства, которые, боюсь, неподвластны даже самому решительному человеку.";
				link.l1 = "Обстоятельства? Уверяю вас, мадемуазель, для "+GetFullName(pchar)+" не существует непреодолимых преград. Расскажите, что случилось - возможно, я смогу вам помочь.";
			}
			else
			{
				dialog.text = "О, месье, похоже, вы - настоящий мастер говорить красивые слова. Признаюсь, вам практически удалось вызвать улыбку на моём лице. Но, увы, дуэль не сможет разрешить мою проблему. Тот, кто омрачил мой день, - скорее не злодей, а лишь обстоятельства, неподвластные даже столь доблестному кавалеру, как вы.";
				link.l1 = "Обстоятельства? Уверяю вас, мадемуазель, капитан "+GetFullName(pchar)+" справляется с любыми обстоятельствами! Если же я окажусь бессилен, клянусь вам, я съем шляпу первого же прохожего, что окажется в поле зрения!";
			}
			link.l1.go = "Juli_3";
		break;
		
		case "Juli_3":
			if (pchar.sex == "woman")
			{
				dialog.text = "Если вы действительно настаиваете, я расскажу вам, что произошло. Но прежде мне нужно ваше слово, что этот разговор останется только между нами.";
				link.l1 = "Даю вам честное слово, мадемуазель. Всё, что вы мне расскажете, останется между нами, даже если мне придётся увезти эту тайну на дно морское.";
			}
			else
			{
				dialog.text = "Месье "+pchar.lastname+", вы, без сомнения, умеете развеселить даже глубоко раздосадованную даму. Но прошу вас, пощадите шляпы бедных прохожих. Если вы действительно настаиваете, я расскажу, что случилось. Только дайте слово, что мои слова останутся тайной, известной лишь нам двоим.";
				link.l1 = "Я даю вам слово, мадемуазель, что всё, что вы скажете мне, я буду хранить в тайне даже под страхом смерти.";
			}
			link.l1.go = "Juli_4";
		break;
		
		case "Juli_4":
			dialog.text = "Хорошо. Недавно из моей комнаты пропало ожерелье... Это не просто украшение. Оно было подарено мне человеком, который занимает особое место в моём сердце. Теперь мне кажется, будто я утратила нечто гораздо большее, чем просто вещь\nЯ долго думала, кто мог это сделать, и пришла только к одному выводу. Боюсь, что это кто-то из моей прислуги. Они - единственные, кто имеет доступ в мою комнату и кто может быть заинтересован в краже ожерелья. Но я не могу заявить об этом открыто...";
			link.l1 = "Дело действительно тонкое, если вы не хотите огласки. Но если я собираюсь помочь вам, мне нужно знать, что именно заставляет вас хранить это в тайне. Это необходимо, чтобы я не выдал"+GetSexPhrase("","а")+" вас ненароком. Я долж"+GetSexPhrase("ен","на")+" знать, кого и чего стоит опасаться.";
			link.l1.go = "Juli_5";
			if (pchar.sex == "woman")
			{
				link.l2 = "Не можете? Что ж, мадемуазель, тогда мне остаётся только пожелать вам удачи. Играть в тайные игры - не в моих привычках. Ваша проблема, как мне кажется, вполне решаема, если привлечь стражу. Но, похоже, вы сами решили усложнить ситуацию.";
				link.l2.go = "Juli_end";
			}
			else
			{
				link.l2 = "Не можете? Что ж, прошу меня простить, мадемуазель, но тогда я действительно бессилен. Играть в тайные игры - это не для меня, сударыня. Ваша проблема до безобразия проста: её могло бы легко разрешить вмешательство стражи. Но вы, похоже, предпочли превратить её в тайну мадридского двора.";
				link.l2.go = "Juli_end";
			}
		break;
		
		case "Juli_end":
			dialog.text = "Вот так вы справляетесь с обстоятельствами, "+GetFullName(pchar)+"? Когда вам доверились, вы поворачиваетесь спиной? Надеюсь, вы найдёте задачи, более достойные вашего выдающегося таланта - может быть, подсчёт бочек с ромом или жаркие споры с портовыми лавочниками. Но, по крайней мере, сохраните нашу беседу в тайне, если у вас ещё осталось хоть немного чести. Прощайте.";
			link.l1 = "...";
			link.l1.go = "Juli_end_2";
		break;
		
		case "Juli_end_2":
			DialogExit();
			CloseQuestHeader("UV");
			ChangeCharacterComplexReputation(pchar, "nobility", -5);
			
			LAi_CharacterDisableDialog(npchar);
			npchar.lifeday = 0;
		break;
		
		case "Juli_5":
			dialog.text = "Вы правы, "+GetAddress_Form(NPChar)+", вам нужно знать правду. Это ожерелье - подарок от человека, которому мой дядя, губернатор французской части этого острова, не рад. Он категорически запретил мне даже упоминать его имя. Если он узнает, кем оно было подарено, последствия могут быть разрушительными не только для меня, но и...";
			link.l1 = "Не продолжайте, сударыня. Теперь я знаю достаточно. Уверяю вас, я сделаю всё возможное, чтобы вернуть вам ожерелье, не подвергая вашу тайну ни малейшей угрозе.";
			link.l1.go = "Juli_6";
		break;
		
		case "Juli_6":
			dialog.text = "Спасибо вам, "+GetSexPhrase("месье "+pchar.lastname+"",""+pchar.name+"")+". Ваша решительность и такт тронули меня. Я верю, что в ваших руках моя тайна будет в полной безопасности. Пусть удача сопутствует вам в этом непростом деле.";
			if (pchar.sex == "woman")
			{
				link.l1 = "Удача покоряется тем, кто действует, мадемуазель. Я найду ваше ожерелье, можете не сомневаться.";
			}
			else
			{
				link.l1 = "Удача покоряется сильным, мадемуазель. Как только я найду ожерелье, оно немедленно окажется в ваших прелестных руках.";
			}
			link.l1.go = "Juli_7";
		break;
		
		case "Juli_7":
			DialogExit();
			
			NextDiag.CurrentNode = "Juli_7_again";
			AddQuestRecord("UV", "2");
			AddQuestUserData("UV", "sSex", GetSexPhrase("","а"));
			
			pchar.questTemp.UV_Lavochniki = true;
		break;
		
		case "Juli_7_again":
			if (CheckCharacterItem(PChar, "SM_necklace_Julie"))
			{
				dialog.text = "Ах, капитан, это вы... Вы нашли его? Прошу, скажите, что ожерелье уже у вас.";
				link.l1 = "Вашим переживаниям пришёл конец, Жюли. Ожерелье у меня, и теперь я с большим удовольствием возвращаю его туда, где ему и место - в ваши изящные руки.";
				link.l1.go = "Juli_22";
				DelLandQuestMark(npchar);
			}
			else
			{
				dialog.text = "Ах, капитан, это вы... Вы нашли его? Прошу, скажите, что ожерелье уже у вас.";
				link.l1 = "Увы, Жюли, пока нет. Но не беспокойтесь, я сделаю всё, чтобы вернуть его вам.";
				link.l1.go = "exit";
				NextDiag.TempNode = "Juli_7_again";
				DelLandQuestMark(npchar);
				
			}
		break;
		
		case "Starpom_1":
			dialog.text = "Здравствуйте, месье. Что привело вас на мой корабль?";
			link.l1 = "Я ищу Тристана Ренье, у меня к нему выгодная сделка.";
			link.l1.go = "Starpom_2_sneak";
			link.l2 = "Мне нужен Тристан Ренье, у меня к нему вопрос личного характера.";
			link.l2.go = "Starpom_2_fortune";
			DelLandQuestMark(npchar);
		break;
		
		case "Starpom_2_sneak":
			dialog.text = "Капитана сейчас нет на борту. Думаю, вы сможете найти его где-нибудь в городе.";
			link.l1 = "Может, вы знаете точнее, куда он отправился?";
			link.l1.go = "Starpom_3";
			AddCharacterExpToSkill(pchar, "Sneak", 100);
		break;
		
		case "Starpom_2_fortune":
			dialog.text = "Капитана сейчас нет на борту. Думаю, вы сможете найти его где-нибудь в городе.";
			link.l1 = "Может, вы знаете точнее, куда он отправился?";
			link.l1.go = "Starpom_3";
			AddCharacterExpToSkill(pchar, "Fortune", 100);
		break;
		
		case "Starpom_3":
			dialog.text = "Извините, "+GetAddress_Form(NPChar)+", но капитан не делится со мной своими планами. Мне известно лишь, что он сошёл на берег.";
			link.l1 = "Что ж, и за то спасибо.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("UV_GoldSeagull_RasprashivaemZhiteley");
		break;
		
		case "Captain_1":
			if (pchar.sex == "man")
			{
				dialog.text = "Кто вы такой, чёрт побери? И с какой стати вы ворвались в мою комнату без приглашения?";
				link.l1 = "Меня зовут "+GetFullName(pchar)+". И у меня к вам дело.";
			}
			else
			{
				dialog.text = "Кто вы такая? Не припомню, чтобы звал гостей. Хотя, признаюсь, неожиданные визиты бывают любопытны. Чем обязан?";
				link.l1 = "Меня зовут капитан "+GetFullName(pchar)+". И я пришла по делу.";
			}
			link.l1.go = "Captain_2";
			DelLandQuestMark(npchar);
		break;
		
		case "Captain_2":
			if (pchar.sex == "man")
			{
				dialog.text = "Дело? Какое, дьявол бы вас разорвал, дело?";
				link.l1 = "Очень простое. У вас есть ожерелье, которое я ищу.";
			}
			else
			{
				dialog.text = "По делу, говорите? Интересно... И какого рода дело может привести столь очаровательную девушку прямо ко мне в комнату?";
				link.l1 = "Расслабьтесь, месье слащавец, мне нужно ожерелье. И я знаю, что оно у вас.";
			}
			link.l1.go = "Captain_3";
		break;
		
		case "Captain_3":
			if (pchar.sex == "man")
			{
				dialog.text = "Ха! Ожерелье? Ну есть у меня ожерелье - и что с того? Или вы придумали себе, что я готов с ним расстаться просто так?";
			}
			else
			{
				dialog.text = "Ожерелье, значит? Хм... Да, есть у меня одно. И что же? Каким образом вы хотите его заполучить?";
			}
			if (sti(pchar.Money) >= 5000)
			{
				link.l1 = "Я готов"+GetSexPhrase("","а")+" предложить вам пять тысяч песо. Этой суммы хватит, чтобы вы купили не менее достойное украшение. А это ожерелье вернётся к тому, кто действительно дорожит им всем сердцем.";
				link.l1.go = "Captain_4_commerce";
			}
			link.l2 = "У вас, поверьте, не так уж и много вариантов: либо вы отдадите его по-хорошему, и я уйду, либо я заберу всё, что мне нужно, с вашего трупа. Выбирайте.";
			link.l2.go = "Captain_4_leadership";
		break;
		
		case "Captain_4_commerce":
			if (GetSummonSkillFromName(pchar, SKILL_COMMERCE) >= 45)
			{
				dialog.text = "Пять тысяч? Ну что ж, хорошо, капитан. Забирайте, раз это для вас так важно.";
				link.l1 = "Благодарю вас. Вы сделали правильный выбор.";
				link.l1.go = "exit";
				AddDialogExitQuestFunction("UV_Ozherelie");
				notification("Проверка пройдена", SKILL_COMMERCE);
				GiveItem2Character(pchar, "SM_necklace_Julie");
				ChangeCharacterComplexReputation(pchar, "nobility", 2);
				AddMoneyToCharacter(pchar, -5000);
			}
			else
			{
				dialog.text = "Я покупал это ожерелье не для того, чтобы вести торги с такими, как вы! Это подарок для моей жены, и вам здесь нечего делать. Убирайтесь прочь, пока мы не вышвырнули вас отсюда!";
				link.l1 = "Раз уж вы не хотите расстаться с ожерельем по-хорошему, значит - я заберу его силой.";
				link.l1.go = "exit";
				AddDialogExitQuestFunction("UV_Ozherelie_Duel");
				notification("Недостаточно развит навык (45)", SKILL_COMMERCE);
			}
		break;
		
		case "Captain_4_leadership":
			if (GetSummonSkillFromName(pchar, SKILL_Leadership) >= 45)
			{
				dialog.text = "Аргх... Дерзкий щенок... Думаешь, я испугаюсь твоих глупых угроз? Ха! Ты не знаешь, с кем связался!";
				link.l1 = "Мне плевать, кто ты. Просто отдай ожерелье, и я уйду. Или ты действительно готов умереть за украшение, которое для тебя не ценнее любой другой побрякушки?";
				link.l1.go = "Captain_4_leadership_2";
				notification("Проверка пройдена", SKILL_Leadership);
				AddCharacterExpToSkill(pchar, "Fortune", 100);
			}
			else
			{
				dialog.text = "Я покупал это ожерелье не для того, чтобы вести торги с такими, как вы! Это подарок для моей жены, и вам здесь нечего делать. Убирайтесь прочь, пока мы не вышвырнули вас отсюда!";
				link.l1 = "Раз уж вы не хотите расстаться с ожерельем по-хорошему, значит, я заберу его силой.";
				link.l1.go = "exit";
				AddDialogExitQuestFunction("UV_Ozherelie_Duel");
				notification("Недостаточно развит навык (45)", SKILL_Leadership);
			}
		break;
		
		case "Captain_4_leadership_2":
			dialog.text = "Чёрт бы побрал и тебя, и это проклятое ожерелье! Забирай его. Забирай - и убирайся прочь, пока я не передумал.";
			link.l1 = "Разумное решение! Прощайте.";
			AddDialogExitQuestFunction("UV_Ozherelie");
			GiveItem2Character(pchar, "SM_necklace_Julie");
		break;
		
		case "Juli_22":
			dialog.text = ""+pchar.name+", вы снова вселили в меня радость! Вы вернули не только ожерелье, но и частичку моей души. Ваше благородство достойно восхищения, и я обещаю, что о вашей доблести узнают все, кому я только смогу рассказать!";
			link.l1 = "Ну что вы, мадемуазель, я вернул"+GetSexPhrase("","а")+" его вовсе не ради всеобщего признания. Ваша улыбка - единственная награда, которая мне действительно важна.";
			link.l1.go = "Juli_23";
			TakeItemFromCharacter(pchar, "SM_necklace_Julie");
			AddCharacterExpToSkill(pchar, "Leadership", 300);
		break;
		
		case "Juli_23":
			dialog.text = "Вы так скромны, "+pchar.name+". Но, прошу вас, примите этот сундучок с дублонами. Лишь зная, что вы приняли мой дар, я смогу почувствовать себя уверенной, что отблагодарила вас так, как вы того заслуживаете.";
			link.l1 = "Прошу вас, мадемуазель, не настаивайте. Ваше благодарное слово для меня ценнее любого сундука с дублонами.";
			link.l1.go = "Juli_24_nobility";
			link.l2 = "Если это успокоит вас, мадемуазель, я приму ваш дар. Но знайте, что сделал"+GetSexPhrase("","а")+" я это вовсе не награды ради. "+GetSexPhrase("Ваше признание","Ваша благодарность")+" для меня - куда ценнее этих дублонов.";
			link.l2.go = "Juli_24_chest";
		break;
		
		case "Juli_24_nobility":
			dialog.text = "Я совсем забыла спросить: вам известно, кто же совершил кражу этого ожерелья?";
			link.l1 = "Мне известно только одно, мадемуазель: торговцу это ожерелье, похоже, принесла некая Жизель. И, судя по всему, это далеко не последнее украшение, которое она собирается продать.";
			link.l1.go = "Juli_25";
			ChangeCharacterComplexReputation(pchar, "nobility", 3);
		break;
		
		case "Juli_24_chest":
			dialog.text = "Я совсем забыла спросить: вам известно, кто же совершил кражу этого ожерелья?";
			link.l1 = "Мне известно только одно, мадемуазель: торговцу это ожерелье, похоже, принесла некая Жизель. И, судя по всему, это далеко не последнее украшение, которое она собирается продать.";
			link.l1.go = "Juli_25";
			GiveItem2Character(PChar, "chest");
		break;
		
		case "Juli_25":
			dialog.text = "Жизель? Это же моя служанка! Я подозревала её... но мне не хотелось в это верить. Самое ужасное - что я ведь не могу толком её наказать. Она ведь может вскрыть мою тайну, а этого я допустить не могу.";
			link.l1 = "Что же вы собираетесь делать? Спустить ей всё с рук и позволить и дальше обворовывать вас?";
			link.l1.go = "Juli_26";
		break;
		
		case "Juli_26":
			dialog.text = "О, нет, что вы. Для начала я позабочусь о том, чтобы она больше не находилась рядом со мной. А затем подумаю, как наказать её так, чтобы это выглядело, будто наказание пришло не от меня.";
			link.l1 = "Женская изобретательность - опасное оружие, особенно в руках столь утончённой и проницательной леди. Уверен"+GetSexPhrase("","а")+", ваша служанка даже не догадывается, что партия уже сыграна - и не в её пользу.";
			link.l1.go = "Juli_27";
		break;
		
		case "Juli_27":
			dialog.text = "Ах, капитан, конечно, мне бы не хотелось прибегать ко всякого рода уловкам, но... порой хитрость - единственный верный путь.";
			link.l1 = "Безусловно, Жюли. Не хочется вас покидать, но, увы, долг зовёт. Кто же, как не я, позаботится о моих матросах?";
			link.l1.go = "Juli_28";
		break;
		
		case "Juli_28":
			dialog.text = "До встречи, "+pchar.name+". Прошу, заходите в наш порт почаще. Нашему городу так не хватает "+GetSexPhrase("столь благородных и доблестных мужчин, как вы.","девушек с таким благородным сердцем и решительным духом, как у вас.")+"";
			link.l1 = "Вы мне льстите, мадемуазель. Обещаю, я не упущу ни единого шанса вновь посетить ваш прекрасный город. До скорой встречи.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("UV_Juli_GoodEnd");
		break;
		
		case "Juli_31":	
			if (CheckAttribute(pchar, "questTemp.UV_ojerelie_Julie"))
			{
				switch (rand(1))
				{
					case 0:
						dialog.text = ""+pchar.name+"! Какая неожиданная встреча! Вы всё так же покоряете моря?";
						link.l1 = "Рад вас видеть, мадемуазель. Покоряю, как могу, хотя море, как всегда, непростительно капризно. А вы, надеюсь, наслаждаетесь спокойствием?";
						link.l1.go = "Juli_32";
					break;

					case 1:
						dialog.text = "Ах, капитан "+pchar.lastname+", как же я рада вас видеть! Надеюсь, ваши дела идут хорошо?";
						link.l1 = "Рад"+GetSexPhrase("","а")+" видеть вас, мадемуазель. Дела, как всегда, требуют времени и усилий, но такие встречи, как эта, скрашивают любой день. А как ваши дни?";
						link.l1.go = "Juli_33";
					break;
				}
			}
			else
			{
				switch (rand(1))
				{
					case 0:
						dialog.text = "Капитан "+pchar.lastname+", вы снова здесь? Неужели в нашем скромном городке ещё остались люди, которых вы не успели предать ради горстки золотых монет?";
						link.l1 = "Мадемуазель, я понимаю ваши чувства, но поступилРад"+GetSexPhrase("","а")+" так, как считал"+GetSexPhrase("","а")+" нужным. Иногда правильные решения вызывают боль, и я сожалею, что это задело вас.";
						link.l1.go = "exit";
						NextDiag.TempNode = "Juli_34_zlaya";
					break;

					case 1:
						dialog.text = "Капитан "+pchar.lastname+", опять вы? Неужели ваша жадность столь велика, что вы не в силах оставить наш город в покое и ищете новую жертву?";
						link.l1 = "Мадемуазель, мне жаль, что мои действия вызвали у вас такие чувства, но я поступил"+GetSexPhrase("","а")+" так, как считал нужным.";
						link.l1.go = "exit";
						NextDiag.TempNode = "Juli_34_zlaya";
					break;
				}
			}
			SetTimerFunction("UV_Julie_HelloAgain", 0, 0, 1);
		break;
		
		case "Juli_32":	
			dialog.text = "Последнее время всё действительно тихо и спокойно, и ничто не нарушает этой идиллии. Заходите в наш порт почаще, капитан. Уверена, здесь - и в нашем магазине, и за его пределами, вы найдёте всё, что только пожелаете.";
			link.l1 = "Благодарю, мадемуазель. Я постараюсь заглядывать чаще. Уверен"+GetSexPhrase("","а")+", ваш город ещё не раз меня приятно удивит.";
			link.l1.go = "exit";
			NextDiag.TempNode = "Juli_repeat_residence_1";
		break;
		
		case "Juli_33":	
			dialog.text = "Благодаря вам, капитан, они стали куда спокойнее. Надеюсь, вы ещё не раз порадуете нас своим присутствием.";
			link.l1 = "Безусловно, мадемуазель. Ваш город всегда оставляет только самые приятные впечатления. До скорой встречи.";
			link.l1.go = "exit";
			NextDiag.TempNode = "Juli_repeat_residence_1";
		break;
		
		case "Juli_repeat_residence_1":
			switch (rand(1))
			{
				case 0:
					dialog.text = "Капитан "+pchar.lastname+", мы снова встретились. Удивительно, правда?";
					link.l1 = "Судьба, кажется, сегодня благосклонна к нашим встречам, мадемуазель.";
					link.l1.go = "exit";
					NextDiag.TempNode = "Juli_repeat_residence_1";
				break;

				case 1:
					dialog.text = "Капитан "+pchar.lastname+", похоже, наши пути сегодня снова пересеклись.";
					link.l1 = "Похоже на то, мадемуазель. Рад"+GetSexPhrase("","а")+" снова видеть вас.";
					link.l1.go = "exit";
					NextDiag.TempNode = "Juli_repeat_residence_1";
				break;
			}
		break;
		
		case "Juli_34_zlaya":
			switch (rand(1))
			{
				case 0:
					dialog.text = "Кажется, мы встречаемся слишком часто, капитан. Или вы просто не можете держаться подальше от тех, кого уже предали?";
					link.l1 = "Мадемуазель, наши встречи случайны, но я понимаю ваше негодование. И лишь надеюсь, что со временем вы сможете понять мои мотивы.";
					link.l1.go = "exit";
					NextDiag.TempNode = "Juli_34_zlaya";
				break;

				case 1:
					dialog.text = "Чего вам ещё? Вряд ли вы настолько невезучи, чтобы эта встреча была случайностью. Или всё же решили напомнить мне о своей низости?";
					link.l1 = "Мадемуазель, у меня нет намерения навязываться вам или напоминать о прошлом. Эта встреча и впрямь случайна.";
					link.l1.go = "exit";
					NextDiag.TempNode = "Juli_34_zlaya";
				break;
			}
		break;
	}
}