// диалог по городам
void ProcessCommonDialogEvent(ref NPChar, aref Link, aref NextDiag)
{
    switch (Dialog.CurrentNode)
	{
		case "quests":
			dialog.text = NPCStringReactionRepeat(RandPhraseSimple("Вопросы, " + GetAddress_Form(NPChar) + "?", "Что вам угодно, " + GetAddress_Form(NPChar) + "?"), "Хм, уж не пристаёте ли вы ко мне, " + GetAddress_Form(NPChar) + "? Опять со странными вопросами...", "В течение этого дня вы уже третий раз говорите о каком-то вопросе... Это знаки внимания?",
                          "Опять вопросы будете задавать, " + GetAddress_Form(NPChar) + "?", "block", 1, npchar, Dialog.CurrentNode);
			link.l1 = HeroStringReactionRepeat(RandPhraseSimple("Я передумал"+GetSexPhrase("","а")+"...", "Сейчас мне не о чем говорить."), "Да нет, что ты, красавица...",
                      "Никак нет, дорогуша, склероз...", "Да нет, какие вопросы...", npchar, Dialog.CurrentNode);
			link.l1.go = "exit";
			//--> Старые счёты
			if (CheckAttribute(pchar, "questTemp.OS_Tavern_2"))
			{
				link.l1 = "Мне нужно задать тебе пару вопросов. Ты ведь работала в таверне в тот день, когда пропал бочонок джина? Что ты можешь рассказать о том, что тогда здесь творилось?";
				link.l1.go = "OS_Tavern2_1";
			}
			//<-- Старые счёты
		break;
		
		//--> Старые счёты
		case "OS_Tavern2_1":
			dialog.text = "Я... я не знаю, что и сказать. Всё было как обычно, не было ничего странного.";
			link.l1 = "Да ну? Ничего странного? А как насчёт матроса с 'Морского Волка', который в тот день приставал к тебе? Он, похоже, думал, что ты не против провести с ним ночь.";
			link.l1.go = "OS_Tavern2_2";
			DelLandQuestMark(npchar);
		break;
		
		case "OS_Tavern2_2":
			dialog.text = "Ах, тот! Он... он просто немного перебрал с выпивкой, вот. Такое у нас не редкость, знаете ли. Я, конечно, не давала ему поводов, но он начал приставать. А я дала ему отпор.";
			link.l1 = "Не давала поводов? А вот у него другое мнение на этот счёт. Почему ты разразилась криками именно в этот раз, а ни в какой из других?";
			link.l1.go = "OS_Tavern2_3";
		break;
		
		case "OS_Tavern2_3":
			dialog.text = "Я... я не знаю, что вам ещё сказать! Я правда ничего не знаю! Я ведь... я была у всех на виду весь вечер! Ничего не видела, ничего не слышала! И про бочонок... я не в курсе, не знаю, что с ним стало! К чему этот допрос? Я просто... я просто работала, как всегда!";
			link.l1 = "Мне кажется, ты не договариваешь. Знаешь, ночь в трюме без света и еды творит с людьми чудеса. Хочешь проверить? Или всё же поговорим по-хорошему?";
			link.l1.go = "OS_Tavern2_4_HO";
			link.l2 = "А мне кажется, ты знаешь куда больше, чем говоришь. У тебя сейчас уникальный шанс - рассказать всё, и я умолчу о твоей роли в этом спектакле. Но если промолчишь - тебе же хуже. Я ведь всё равно докопаюсь до правды.";
			link.l2.go = "OS_Tavern2_4_harizma";
		break;
		
		case "OS_Tavern2_4_HO":
			dialog.text = "Я... я... расскажу вам всё! Это всё мой... кавалер, Джек. Джек Вейлс! Он подговорил меня, чтобы я соблазнила любого матроса из 'Морского Волка'. И когда тот проявит наглость, я должна была поднять бучу, чтобы выманить хозяина таверны из-за стойки. Когда страсти начали утихать, два матроса начали бы драку, чтобы задержать его в зале. Так всё и произошло\nЗа это время капитан 'Морского Волка' успел украсть бочонок. Это... это всё, что мне известно, "+GetSexPhrase("господин","госпожа")+"! Пожалуйста, не выдавайте меня! Я ведь... я ведь всего лишь... я просто... хотела, чтобы Джек наконец-то начал относиться ко мне с уважением! Я ведь помогла ему...";
			link.l1 = "Одному помогала, а другого без зазрения совести под удар подставила?! Ну что ж, слово я своё держу – тебя выдавать не стану. Но теперь тебе с этим жить! Из-за твоей глупости у трактирщика могли быть большие неприятности. Где найти твоего Джека? И помни: соврёшь - я вернусь. И поверь, тебе это совсем не понравится.";
			link.l1.go = "OS_Tavern2_5";
			AddComplexSelfExpToScill(40, 40, 40, 0);
			ChangeCharacterComplexReputation(pchar, "nobility", -3);
		break;
		
		case "OS_Tavern2_4_harizma":
			dialog.text = "Я... я... расскажу вам всё! Это всё мой... кавалер, Джек. Джек Вейлс! Он подговорил меня, чтобы я соблазнила любого матроса из 'Морского Волка'. И когда тот проявит наглость, я должна была поднять бучу, чтобы выманить хозяина таверны из-за стойки. Когда страсти начали утихать, два матроса начали бы драку, чтобы задержать его в зале. Так всё и произошло\nЗа это время капитан 'Морского Волка' успел украсть бочонок. Это... это всё, что мне известно, "+GetSexPhrase("господин","госпожа")+"! Пожалуйста, не выдавайте меня! Я ведь... я ведь всего лишь... я просто... хотела, чтобы Джек наконец-то начал относиться ко мне с уважением! Я ведь помогла ему...";
			link.l1 = "Одному помогала, а другого без зазрения совести под удар подставила?! Ну что ж, слово я своё держу – тебя выдавать не стану. Но теперь тебе с этим жить! Из-за твоей глупости у трактирщика могли быть большие неприятности. Где найти твоего Джека? И помни: соврёшь - я вернусь. И поверь, тебе это совсем не понравится.";
			link.l1.go = "OS_Tavern2_5";
			AddCharacterExpToSkill(pchar, "Leadership", 100);
		break;
		
		case "OS_Tavern2_5":
			dialog.text = "Я не думала, что всё так серьёзно! Это ведь всего лишь бочонок... Джек живёт напротив. Он арендует дом. Я... я ничего больше не знаю! Простите меня, пожалуйста! Капитан, клянусь, я больше так никогда не поступлю!";
			link.l1 = "Займись делом и не вздумай рыдать, чтобы хозяин ничего не заподозрил.";
			link.l1.go = "OS_Tavern2_6";
		break;
		
		case "OS_Tavern2_6":
			DialogExit();
			DeleteAttribute(pchar, "questTemp.OS_Tavern_2");
			AddQuestRecord("OS", "4");
			
			//
			pchar.GenQuestBox.PuertoPrincipe_QuestHouse_1.box1.items.cask_gin = 1;
			pchar.GenQuestBox.PuertoPrincipe_QuestHouse_1.box1.items.map_full = 1;
			pchar.GenQuestBox.PuertoPrincipe_QuestHouse_1.box1.items.jewelry2 = 10;
			pchar.GenQuestBox.PuertoPrincipe_QuestHouse_1.box1.items.GunPowder = 50;
			pchar.GenQuestBox.PuertoPrincipe_QuestHouse_1.box1.items.bullet = 50;
			
			PChar.quest.OS_Zasada.win_condition.l1 = "item";
			PChar.quest.OS_Zasada.win_condition.l1.item = "cask_gin";
			PChar.quest.OS_Zasada.function = "OS_Zasada";
		break;
		//<-- Старые счёты
	}
	UnloadSegment(NPChar.FileDialog2);  // если где-то выход внутри switch  по return не забыть сделать анлод
}

