// диалог по городам
void ProcessCommonDialogEvent(ref NPChar, aref Link, aref NextDiag)
{
    switch (Dialog.CurrentNode)
	{
		case "quests":
			dialog.text = NPCStringReactionRepeat("Все сплетни города "+ GetCityName(npchar.city) +" к вашим услугам. Что бы вы хотели узнать?",
                          "Мы только что поднимали эту тему. Вы, вероятно, запамятовали...", "Сегодня вы уже третий раз говорите о каком-то вопросе...",
                          "Что ты "+ GetSexPhrase("заладил","заладила") +" как попугай одно и то же...", "block", 1, npchar, Dialog.CurrentNode);
			link.l1 = HeroStringReactionRepeat("Знаешь, " + NPChar.name + ", как-нибудь в следующий раз.", "Точно, "+ GetSexPhrase("забыл","забыла") +" что-то...",
                      "Да уж, действительно в третий раз...", "Да уж...", npchar, Dialog.CurrentNode);
			link.l1.go = "exit";
			//работорговец
			if (pchar.questTemp.Slavetrader == "EscapeSlave_Villemstad")
            {
                link.l1 = "Слышал"+ GetSexPhrase("","а") +", у вас на острове заваруха была серьёзная... Рабы, вроде, восстали.";
                link.l1.go = "EscapeSlaveVillemstad_T1";
            }
			//Португалец
			if (CheckAttribute(pchar, "questTemp.Portugal") && pchar.questTemp.Portugal == "SeekPortVillemstad")
            {
                link.l1 = "Слышал, что гнусный негодяй Барт Португалец наконец-таки попался в руки правосудия! Он у вас в тюрьме? А когда состоится его казнь, не в курсе? Я бы пришёл посмотреть, у меня с этим мерзавцем свои счёты...";
                link.l1.go = "Portugal";
            }
			//--> Тайна Бетси Прайс
			if (CheckAttribute(pchar, "questTemp.TBP_Tavern"))
			{
				link.l1 = "Послушай, "+npchar.name+", я слышал"+GetSexPhrase("","а")+", у тебя недавно появилась новая красавица-официантка... и уже успела исчезнуть?";
				link.l1.go = "TBP_Tavern_1";
			}
			if (CheckAttribute(pchar, "questTemp.TBP_Tavern2"))
			{
				link.l1 = "Послушай, "+npchar.name+", в вечер исчезновения Бетси ты не заметил никого подозрительного рядом с ней? Может, она с кем-то говорила?";
				link.l1.go = "TBP_Tavern2_11";
			}
			if (CheckAttribute(pchar, "questTemp.TBP_Tavern3"))
			{
				link.l1 = "Ну что, "+npchar.name+", хорошая новость - твоя драгоценная официантка жива и здорова. Придётся тебе снова увеличивать запасы рома, скоро народ потянется обратно.";
				link.l1.go = "TBP_Tavern3_21";
			}
			//<-- Тайна Бетси Прайс
 		break;

		//работорговец
		case "EscapeSlaveVillemstad_T1":
			dialog.text = "Да уж, такого никогда не бывало... Больше тысячи рабов участвовали в бунте. Две плантации сожгли дотла, а хозяев убили почти всех поголовно. Комендант опасался, что они на город пойдут - ввёл военное положение. А все началось с истории любви двух невольников - Таманго и Изауры...";
			link.l1 = "Интересно! Расскажи подробнее, кто это?";
			link.l1.go = "EscapeSlaveVillemstad_T2";
		break;
		
		case "EscapeSlaveVillemstad_T2":
				dialog.text = "Таманго и Изаура - это рабы с плантации Бленхейм, ну, с той, которую сожгли первой. Любовь у них была. А потом приехал из Европы сын хозяина плантации, Леонсио, и положил глаз на Изауру. В общем, решил наложницей своей сделать. Это очень не понравилось Таманго, да и Изаура была не в восторге - любила она этого черномазого\nА надо сказать, что Таманго у себя в Африке был каким-то не то вождем, не то царьком... Здоров он, как бык, топором махать мастер, да и среди рабов авторитет. Вот и подбил их на восстание\nНочью напали на охрану и вырезали всех голландцев в Бленхейме. Изаура открыла им ворота усадьбы - они и там всех перебили. Потом пошли всей толпой на соседнюю плантацию, Бленбург, и устроили там такую же резню. Затем ушли в джунгли и исчезли без следа...";
			link.l1 = "Вот так история! Прямо сюжет для романа! И откуда ты всё это знаешь?";
			link.l1.go = "EscapeSlaveVillemstad_T3";
		break;
		
		case "EscapeSlaveVillemstad_T3":
			dialog.text = "Слухи, "+ GetSexPhrase("минхер","госпожа") +", слухами земля полнится. Ром развязывает языки, достаточно просто слушать...";
			link.l1 = "И чем всё закончилось? Нашли этих черномазых?";
			link.l1.go = "EscapeSlaveVillemstad_T4";
		break;
		
		case "EscapeSlaveVillemstad_T4":
				dialog.text = "Какое там! Пока не подоспело подкрепление, никто и шагу в джунгли не делал. Потом прибыл военный корабль с отрядом солдат, обыскали они остров - никого нет.";
			link.l1 = "Ну ты подумай! Тысяча человек - и все как в воду канули!";
			link.l1.go = "EscapeSlaveVillemstad_T5";
		break;
		
		case "EscapeSlaveVillemstad_T5":
			dialog.text = "Именно, "+ GetSexPhrase("минхер","госпожа") +"! В воду они и канули!";
			link.l1 = "Ты это о чём сейчас, " + npchar.name + "? Не понимаю что-то...";
			link.l1.go = "EscapeSlaveVillemstad_T6";
		break;
		
		case "EscapeSlaveVillemstad_T6":
			dialog.text = "Хе-хе... Бьюсь об заклад - уплыли они с острова. Дело в том, что на следующую ночь после восстания со стоянки кораблей пропал барк. Не пить мне рому до конца дней моих, если это не дело рук Таманго и его братии! Поэтому и нет их на острове.";
			link.l1 = "Ладно, спасибо за интересный рассказ, " + npchar.name + ". Хотя не представляю, как негры могут управляться с парусами.";
			link.l1.go = "EscapeSlaveVillemstad_T7";
		break;
		
		case "EscapeSlaveVillemstad_T7":
			dialog.text = "Ну, видать могут... Может, кто из них раньше матросом ходил. Заглядывайте ко мне ещё, " + pchar.name + ", не забывайте, а я вам ещё историй приготовлю.";
			link.l1 = "Спасибо! Ну, мне пора.";
			link.l1.go = "exit";
			AddQuestRecord("Slavetrader", "22_2");
			pchar.questTemp.Slavetrader = "EscapeSlaveVillemstad_P";
		break;						

		case "Portugal":
			dialog.text = "Да, отловили этого пирата, всё верно. И вы можете себе представить как? Его подобрали на шлюпке, одного, посреди моря. Он даже пикнуть не успел, как отправился в трюм к крысам. Забавно, правда - такой опасный пират и так глупо попасться!";
			link.l1 = "И чего его в одиночку в море понесло?";
			link.l1.go = "Portugal_1";
		break;
		
		case "Portugal_1":
			dialog.text = "Наверно, решил слинять от своих подельничков, не иначе... не поделили чего-то. А теперь им занялась сама Компания - а с этими ребятами шутки плохи. Говорят, он не так давно захватил судно Компании с чем-то ценным. Видимо, только потому, что из него хотят выудить некие сведения, он до сих пор не болтается на виселице.";
			link.l1 = "Так когда состоится его казнь, ты не знаешь?";
			link.l1.go = "Portugal_2";
		break;
		
		case "Portugal_2":
			dialog.text = "Этого никто не знает. Думаю, как узнает Компания, что хочет, так и повяжут ему пеньковый галстук. Португалец сейчас в тюрьме под надёжной охраной. Недавно к нам привезли ещё и его боцмана - с тем так ещё удивительнее - он сам сдался голландцам в Филипсбурге. Ну, они его и пристроили по соседству с бывшим капитаном, хе-хе...";
			link.l1 = "Чудеса да и только! Ладно, буду следить за новостями. Не хочу пропустить это представление. Бывай, "+npchar.name+"!";
			link.l1.go = "Portugal_3";
		break;
		
		case "Portugal_3":
			DialogExit();
			pchar.questTemp.Portugal = "PortugalInPrison";
			AddQuestRecord("Portugal", "32");
		break;
		
		//--> Тайна Бетси Прайс
		case "TBP_Tavern_1":
			dialog.text = "Ох, видели бы вы её, капитан! Бетси... такая грация, такая улыбка! Мужчины сюда табунами шли, лишь бы на неё взглянуть. А уж сколько серебра они оставляли в моей таверне... Но три дня назад она не вышла на работу. Разумеется, я посылал людей к ней домой, но её там нет. В доме беспорядок, личные вещи исчезли\nЯ уже не знаю, что и думать. Стража, как всегда, лишь отмахнулась. Говорят - дела у них есть поважнее, чем поиски девиц пропавших, загуляла, мол, скоро вернётся. Капитан, может, вы сможете её разыскать? Если приведёте её сюда, я заплачу вам сто дублонов. Я не могу просто так её потерять, понимаете? Она ведь настоящая находка! Мне нужно её вернуть, во что бы то ни стало!";
			link.l1 = "Посмотрим, что можно сделать. Может, она вела себя странно перед исчезновением или получила какие-то дурные новости?";
			link.l1.go = "TBP_Tavern_2";
			link.l2 = "Искать девку, которая скорее всего, просто взяла и сбежала? У меня есть дела поважнее. Разбирайся сам.";
			link.l2.go = "TBP_Tavern_End";
			DelLandQuestMark(npchar);
		break;
		
		case "TBP_Tavern_End":
			DialogExit();
			DeleteAttribute(pchar, "questTemp.TBP_Tavern");
			CloseQuestHeader("TBP");
		break;
		
		case "TBP_Tavern_2":
			dialog.text = "В последний день перед исчезновением она ушла довольная, даже счастливая! Ни намёка на тревогу, ни слова о том, что собирается уйти. Просто взяла - и пропала!";
			link.l1 = "Любопытно... Где я могу найти её дом?";
			link.l1.go = "TBP_Tavern_3";
		break;
		
		case "TBP_Tavern_3":
			dialog.text = "Она жила выше по улице, в лачуге за домом, который стоит напротив особняка с синим балконом. Здесь недалеко.";
			link.l1 = "Что ж, не буду терять времени. Если мне что-то удастся выяснить, я дам тебе знать.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_Poorman");
		break;
		
		case "TBP_Tavern2_11":
			dialog.text = "Подозрительного? Да вокруг неё ухажёров толпы крутились, и каждый по-своему подозрителен! Кокетка она ещё та - знала, как внимание привлекать.";
			link.l1 = "Это я уже понял"+GetSexPhrase("","а")+". Но, может, кто-то особенно выделялся?";
			link.l1.go = "TBP_Tavern2_12";
			DelLandQuestMark(npchar);
		break;
		
		case "TBP_Tavern2_12":
			dialog.text = "Хм... Ну, один был. В тот вечер он ей кулон с камеей подарил. Сидел тут, глаз с неё не сводил, весь вечер вился вокруг.";
			if (CheckAttribute(pchar, "questTemp.TBP_BuyKulon"))
			{
				link.l1 = "Это, случайно, не тот кулон? (Показать камею, купленную у нищего)";
				link.l1.go = "TBP_Tavern2_13";
			}
			else
			{
				link.l1 = "Кулон с камеей, говоришь...";
				link.l1.go = "exit";
				AddDialogExitQuestFunction("TBP_SearchHouseWithFonar");
			}
		break;
		
		case "TBP_Tavern2_13":
			dialog.text = "Он! Точно он! Капитан, вам удалось уже что-то узнать?";
			link.l1 = "Все подробности потом, "+npchar.name+", сейчас нельзя терять времени.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_SearchHouseWithFonar");
			RemoveItems(pchar, "jewelry24", 1); 
			notification("Отдано: Кулон с камеей", "None");
		break;
		
		case "TBP_Tavern3_21":
			dialog.text = "Это превосходно, капитан! А я уж было решил, что больше её не увижу. Так что же всё-таки произошло? Она и правда хотела сбежать?";
			link.l1 = "Скажем так, ей пришлось разбираться с некоторыми проблемами из прошлого. Но, похоже, всё уже позади, и скоро она снова сможет вернуться к работе.";
			link.l1.go = "TBP_Tavern3_22_leadership";
			link.l2 = "Ну, скажем так, ей понадобился небольшой перерыв от созерцания твоей скучной физиономии. Ха-ха! Да не хмурься ты так, я же шучу. У каждой леди должны быть свои маленькие тайны...";
			link.l2.go = "TBP_Tavern3_22_fortune";
			DelLandQuestMark(npchar);
		break;
		
		case "TBP_Tavern3_22_leadership":
			dialog.text = "Что ж, главное, что она вернётся к работе. Вы заслужили свою награду, капитан. Вот, держите - сто дублонов, как и договаривались. А ещё, возьмите эту карту. Один из посетителей оставил её здесь, да так и не вернулся. Судя по всему, она ведёт к сокровищам.";
			link.l1 = "Ну что ж, это я проверю. Спасибо.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_BetsiBackToWork");
			AddCharacterExpToSkill(pchar, "Leadership", 100);
			AddItems(pchar, "gold_dublon", 100);
			GiveItem2Character(PChar, "map_full");
		break;
		
		case "TBP_Tavern3_22_fortune":
			dialog.text = "Что ж, главное, что она вернётся к работе. Вы заслужили свою награду, капитан. Вот, держите - сто дублонов, как и договаривались. А ещё, возьмите эту карту. Один из посетителей оставил её здесь, да так и не вернулся. Судя по всему, она ведёт к сокровищам.";
			link.l1 = "Ну что ж, это я проверю. Спасибо.";
			link.l1.go = "exit";
			AddDialogExitQuestFunction("TBP_BetsiBackToWork");
			AddCharacterExpToSkill(pchar, "Fortune", 100);
			AddItems(pchar, "gold_dublon", 100);
			GiveItem2Character(PChar, "map_full");
		break;

		
		
		//<-- Тайна Бетси Прайс
	}
	UnloadSegment(NPChar.FileDialog2);  // если где-то выход внутри switch  по return не забыть сделать анлод
}

