void ProcessDialogEvent()
{
	ref NPChar, sld, rItm, rItem;
	aref Link, NextDiag, rType;
	int i, n;
	string sTemp, sStr, sStr2, sGun, sBullet, attrL;
	
	DeleteAttribute(&Dialog,"Links");
	
	makeref(NPChar,CharacterRef);
	makearef(Link, Dialog.Links);
	makearef(NextDiag, NPChar.Dialog);

	switch(Dialog.CurrentNode)
	{
		case "Exit":
			NextDiag.CurrentNode = NextDiag.TempNode;
			DialogExit();
		break;
		
		case "First time":
			dialog.text = "Что вам надо?";
			link.l1 = "Ничего.";
			link.l1.go = "exit";
		break;
		
		
		
		case "Alonso":
			NextDiag.TempNode = "Alonso";
			
			if (GetDLCenabled(DLC_APPID_1))
			{
				if(CheckAttributeEqualTo(pchar, "questTemp.LoyaltyPack.FirstStage", "ready"))
				{
					dialog.text = "Разрешите обратиться, кэп?";
					link.l1 = "Позже, Алонсо.";
					link.l1.go = "exit";
					link.l2 = "Разрешаю.";
					link.l2.go = "Alonso_1";
					break;
				}
				if(CheckAttributeEqualTo(pchar, "questTemp.LoyaltyPack.SecondStage", "ready"))
				{
					dialog.text = "Разрешите обратиться, кэп?";
					link.l1 = "Позже, Алонсо.";
					link.l1.go = "exit";
					link.l2 = "Разрешаю.";
					link.l2.go = "Alonso_Lvl_8_Start";
					break;
				}
				if(CheckAttributeEqualTo(pchar, "questTemp.LoyaltyPack.ThirdStage", "ready"))
				{
					dialog.text = "Разрешите обратиться, кэп?";
					link.l1 = "Позже, Алонсо.";
					link.l1.go = "exit";
					link.l2 = "Разрешаю.";
					link.l2.go = "Alonso_Lvl_12_Start";
					break;
				}
				if(CheckAttributeEqualTo(pchar, "questTemp.LoyaltyPack.FourthStage", "ready"))
				{
					dialog.text = "Разрешите обратиться, кэп?";
					link.l1 = "Позже, Алонсо.";
					link.l1.go = "exit";
					link.l2 = "Разрешаю.";
					link.l2.go = "Alonso_Lvl_16_Start";
					break;
				}
			}
			
			dialog.text = "Доложить нечего, кэп.";
			link.l1 = "Так держать, Алонсо.";
			link.l1.go = "exit";
		break;
		
		case "Alonso_1":
			DelLandQuestMark(npchar);
			dialog.text = "Как вы?";
			link.l1 = "Ты о чём?";
			link.l1.go = "Alonso_2";
		break;
		
		// Основная развилка стадии 1
        case "Alonso_2":
            dialog.text = "Вот уже несколько месяцев вы бороздите просторы Карибского моря, а некоторые тут и недели не выживают. От команды — вам почёт и уважение, а от меня — тревога за ваше будущее.\n"+
                          "Уж поделитесь мыслями, уважьте команду. Куда идёт "+pchar.ship.name+"?";
                          
            link.l1 = "У меня нет плана. Хочется сначала изучить этот край. А приключения нас сами найдут.";
            link.l1.go = "Alonso_Choice_1";
            
            link.l2 = "В этом море много хищников, Алонсо. И "+pchar.ship.name+" — самый мелкий из них. Пока что.";
            link.l2.go = "Alonso_Choice_2";
            
            link.l3 = "Мне нравится зарабатывать деньги. Желательно легально. Но это уж как получится.";
            link.l3.go = "Alonso_Choice_3";
			
            if (!SandBoxMode)
            {
                link.l4 = "Ты же знаешь. После нашего памятного разговора на «Улиссе» всё только усложнилось…";
                link.l4.go = "Alonso_Choice_4";
            }
        break;
        
        case "Alonso_Choice_1":
            dialog.text = "Вот она — свобода! Главное, чтобы на содержание корабля хватало, да что-то в сундуках оставалось на чёрный день.\n"+
                          "Куда бы вас ни вело настроение, задание или карта сокровищ: берите доставку пассажиров, фрахты и вообще любую мелкую работу — коли будет по пути.\n"+
                          "Ещё не помешает заниматься мелкой торговлей, скупая товары по дешевке там, где это очевидно выгодно.\n"+
                          "Ну, а если по пути увидите одинокого торговца… Хе. В общем-то, вы правы, кэп. Приключения нас сами найдут.";
            
            AddCharacterExpToSkill(pchar, SKILL_LEADERSHIP, 50);
            AddCharacterExpToSkill(pchar, SKILL_GRAPPLING, 50);
            AddCharacterExpToSkill(pchar, SKILL_COMMERCE, 50);
            
            link.l1 = "Спасибо за добрый совет, Алонсо.";
            link.l1.go = "Alonso_Common_End";
        break;
        
        case "Alonso_Choice_2":
            dialog.text = "Дело прибыльное, коли корабль позволяет. Ищите одиноких торговцев и продемонстрируйте принцип «скупой платит дважды» на их примере.\n"+
                          "К несчастью для вас, дальше вступает в дело уже другая яркая фраза: «Шила в мешке не утаишь». Всегда найдётся болтливый язык в команде, который в первом же порту разболтает о ваших похождениях.\n"+
                          "Так что или грабьте всех, но понемногу, или же выберите себе одного врага на всю жизнь.\n"+
                          "Впрочем, тут я погорячился. Если совсем прижмёт, то в Порт-Рояле есть адвокат, который за звонкие песо решает любые проблемы с властями. Считай, налог на пиратство, хе-хе!";
            
            AddCharacterExpToSkill(pchar, SKILL_GRAPPLING, 50);
            AddCharacterExpToSkill(pchar, SKILL_ACCURACY, 50);
            ChangeCharacterComplexReputation(pchar, "nobility", -1);
            
            link.l1 = "Спасибо за добрый совет, Алонсо.";
            link.l1.go = "Alonso_Common_End";
        break;
        
        case "Alonso_Choice_3":
            dialog.text = "Э-э. Тут уж я вам не помощник, кэп. Корабль нужен торговый: баркентина, а лучше — барк. Наверное, я ещё пожалею об этом, но пушки лучше будет взять полегче или и вовсе выкинуть.\n"+
                          "Берите работу на доставку грузов у хозяев магазинов, а по пути занимайтесь торговлей самостоятельно и возите пассажиров.\n"+
                          "Как накопите денег, вкладывайтесь в лавки и банки. Вот увидите, кэп, однажды наступит момент, когда деньги начнут делать деньги, и вы сможете позволить себе большой корабль с парой сотен молодцов на борту.\n"+
                          "За который, кстати, платить будете уже не вы, а ваше дело.";
            
            AddCharacterExpToSkill(pchar, SKILL_COMMERCE, 50);
            AddCharacterExpToSkill(pchar, SKILL_SAILING, 50);
            ChangeCharacterComplexReputation(pchar, "nobility", 1);
            
            link.l1 = "Спасибо за добрый совет, Алонсо.";
            link.l1.go = "Alonso_Common_End";
        break;
        
        case "Alonso_Choice_4":
            dialog.text = "А вот я считаю иначе, кэп. На «Улиссе» вы были пассажиром, а у этих ребят над своей судьбой власти нет. Теперь вы — капитан, который заслужил свою шляпу, а значит, вы способны решить любую проблему. Я же вам ещё давно говорил, что нет статуса выше в нашем мире.\n"+
                          "Печёнкой чую, эпопея с вашим братом затянется ещё на годы, так что позаботьтесь сначала о себе. Месье Мишель никуда не уйдёт, хе-хе…\n"+
                          "На Карибах не только у вас проблемы. Самое время — помочь другим, попутно заработав деньги, снаряжение и знакомства. Заодно научитесь всему, что от вас однажды потребуется в этом семейном деле…";
            
            AddCharacterExpToSkill(pchar, SKILL_LEADERSHIP, 100);
            ChangeCharacterComplexReputation(pchar, "nobility", 1);
            
            link.l1 = "Спасибо за добрый совет, Алонсо.";
            link.l1.go = "Alonso_Common_End";
        break;
		
        case "Alonso_Common_End":
            dialog.text = "Не ограничивайте себя одной ролью, кэп. Занимайтесь только тем, чем хотите. Берите всё и не отдавайте ничего. И всё у вас сложится.";
            link.l1 = "И за напутствие тоже спасибо.";
            link.l1.go = "Alonso_Common_End_2";
        break;
        
        case "Alonso_Common_End_2":
            dialog.text = "Э-э, так вы за это и платите мне, кэп. Думаете, вашей команде достаточно скромного жалованья, чтобы исполнять ваши приказы?\n"+
                          "Десятки мужиков заперты в тесном пространстве, и никто не знает, когда будет суша и будет ли она вообще. А корабль погубить — вообще плёвое дело.";
            link.l1 = "Да-да, знакомые речи, Алонсо. Как там про корабль давеча говорил?";
            link.l1.go = "Alonso_Common_End_3";
        break;
        
        case "Alonso_Common_End_3":
            dialog.text = "Хе! Корабль — это тюрьма, военный лагерь и монастырь. Мужское сборище, в общем. Так что проблемы тут решаются либо словом, либо плетью. В вашем случае последнее, хе-хе, неприменимо, вот я и захотел языками с вами почесать. Чтоб вам, значит, полегче стало.";
            link.l1 = "А ты сам хоть раз бывал в тюрьме? В армии? В монастыре, упаси Господь? И вообще, Алонсо, расскажи-ка о себе. Я ведь почти ничего про тебя не знаю.";
            link.l1.go = "Alonso_Story_1";
        break;
        
        // История Алонсо
        case "Alonso_Story_1":
            dialog.text = "А вот в монастырях я не бывал, врать не буду. Впрочем, довелось мне как-то служить в Священной Инквизиции…";
            link.l1 = "Как тебя угораздило-то?";
            link.l1.go = "Alonso_Story_2";
        break;
        
        case "Alonso_Story_2":
            dialog.text = "О! Дело было так. Довелось мне потягать лямку наёмника на европейской войне. Чёрт его знает, с чего всё началось и кто за кого воевал. Знали мы только, что война шла уже лет тридцать и какой командир относительно регулярно выплачивает жалованье. Вот это была авантюра!\n"+
                          "Дело было в сорок втором... или сорок первом? Неважно. Две компании, обе на службе у императора, встретились в лесу. В тумане. И давай друг друга крошить! Три дня резни!";
            link.l1 = "Это как?";
            link.l1.go = "Alonso_Story_3";
        break;
        
        case "Alonso_Story_3":
            dialog.text = "Попробуй разберись в тумане, кто свой, а кто чужой. Да и не платили нам уже три месяца как, так хоть с трофеев каждый думал поживиться.\n"+
                          "Половину друг друга положили. А потом выяснилось — уже поздно было. Тут я и познакомился с одним московитом. Здоровенный такой, как медведь, но душа — золото!";
            link.l1 = "И что дальше?";
            link.l1.go = "Alonso_Story_4";
        break;
        
        case "Alonso_Story_4":
            dialog.text = "Оно ведь как на войне? Кто первый доложил — тот и герой. Вот мы с ним и смекнули — надо из этого позора выгоду извлечь!\n"+
                          "Сговорились с парнями, пошли к нанимателю, доложили о «великой баталии». Погибшим жалованье срезали, выжившим — выплатили, мне и дружку моему — премия, а командиру — доля.";
            link.l1 = "Так ты богач, Алонсо.";
            link.l1.go = "Alonso_Story_5";
        break;
        
        case "Alonso_Story_5":
            dialog.text = "Ха! Потом неделю вино пили да в карты резались. Повезло, что мой новый товарищ из далёкого Московского царства оказался падок на всякие редкие штучки, а то бы я в долговую яму угодил. Выкупил у меня трофей: роскошный трёхствольный пистоль, да по хорошей цене — не стал наживаться на моей беде.";
            link.l1 = "История, прямо скажем, фантастическая, Алонсо. Сдаётся мне, что ты её только что выдумал.";
            link.l1.go = "Alonso_Gift";
        break;
        
        // Вручение подарка
        case "Alonso_Gift":
            dialog.text = "Обижаете, кэп. Вот, держите подарочек.";
            link.l1 = "Что это?";
            link.l1.go = "Alonso_Gift_2";
        break;
        
        case "Alonso_Gift_2":
		
			// Выдаем Берендейку
            GiveItem2Character(pchar, "talisman20");
			SetAlchemyRecipeKnown("talisman20");
            
            dialog.text = "Берендейка для ружейного боя. На родине моего друга-московита такие все носят. Он сам так говорил.\n"+
                          "Пусть она вам послужит, кэп. Считайте, подарок от команды.";
            link.l1 = "Неожиданно! Спасибо, Алонсо. Так что там по поводу твоей службы в инквизиции?";
            link.l1.go = "Alonso_Escape";
        break;
        
        case "Alonso_Escape":
            PlaySound("ambient\SEA\Ship_bell_Two.wav");
            dialog.text = "Э-э…\n"+
                          "Склянки пробили, кэп! Пора мне за работу, так что в другой раз.";
            link.l1 = "Мы ещё продолжим этот разговор. Спасибо за подарок!";
            link.l1.go = "exit";
            
			AddDialogExitQuestFunction("LoyaltyPack_FirstStage_DlgExit");
        break;
		
		// (Уровень 8) - Продолжаем историю
        case "Alonso_Lvl_8_Start":
			DelLandQuestMark(npchar);
			dialog.text = "Вы многого достигли с нашего последнего разговора, и никто: ни команда, ни я — не сомневается в ваших талантах.";
			link.l1 = "А были сомнения?";
			link.l1.go = "Alonso_Lvl_8_1";
        break;

        case "Alonso_Lvl_8_1":
            dialog.text = "Конечно были. Народ у нас простой — привыкли готовиться к худшему. Наслаждайтесь свободой, кэп. Если вы продолжите в том же духе, то увидите уже совсем другую сторону Карибского моря.";
            link.l1 = "Приятно слышать. А теперь расскажи про свою службу в инквизиции. В прошлый раз ты начал рассказ с какой-то армейской байки и на ней же и закончил.";
            link.l1.go = "Alonso_Lvl_8_2";
        break;

        case "Alonso_Lvl_8_2":
            dialog.text = "А что рассказывать? После бессмысленной, но очень прибыльной резни в лесу мы крепко сдружились с этим московитом и провернули ещё немало делишек.\n"+
                          "Помню, как-то решили обоз императорский пограбить. Разведка донесла — везут трофеи, золото, оружие...";
            link.l1 = "И что, удалось?";
            link.l1.go = "Alonso_Lvl_8_3";
        break;

        case "Alonso_Lvl_8_3":
            dialog.text = "Дело-то плёвое. Напали мы с двух сторон, охрану разогнали, открываем фургоны — а там капуста! Тухлая, вонючая капуста для какого-то гарнизона! Но знаете что? Мы неделю не жрали, так что даже этому обрадовались!";
            link.l1 = "Можно подумать, на моём корабле кормят лучше.";
            link.l1.go = "Alonso_Lvl_8_4";
        break;

        case "Alonso_Lvl_8_4":
            dialog.text = "Ну сейчас-то я привык. А тогда… После недели на подножном корму — хоть кору с деревьев грызи!\n"+
                          "Но мой друг не унывал. Достал фляжку со своей фирменной настойкой — московский рецепт, говорит. А нам-то что, главное, чтоб не уксус! После пары глотков даже капуста показалась деликатесом!";
            link.l1 = "Отвратительно.";
            link.l1.go = "Alonso_Lvl_8_5";
        break;

        case "Alonso_Lvl_8_5":
            dialog.text = "Отвратительно состояние наших бочонков с пресной водой, а то московское пойло в тот день мне жизнь спасло.";
            link.l1 = "Это как?";
            link.l1.go = "Alonso_Lvl_8_6";
        break;

        case "Alonso_Lvl_8_6":
            dialog.text = "Напились мы до чёртиков прямо среди плавающей в дорожной грязи капусты. Ну а там, слово за слово, поспорил я с одним дворянишкой. Из германцев был, весь такой холёный, расфуфыренный. С нами пить брезговал, только чистил свой мушкет да едкие словечки выдавал.\n"+
                          "Сидим мы, отдыхаем, заливаем горе над капустой. А он как давай поучать нас на тему военной мудрости. Мол, верные палаши и пики наши скоро забыты будут, а вот багинет — будущее и всему голова.\n"+
                          "Ну и поспорил я с ним, да так, что договорились биться до смерти — как раз на штыках. Не спрашивайте, как так вышло, сам не помню.\n"+
                          "А багинетов-то у нас в роте всего два было. Один — у офицерика этого, а другой — у Фокса, англичанина. Одолжил я у него фузею да заколошматил ею германца до смерти и был таков.";
            link.l1 = "Ты же был голоден и пьян.";
            link.l1.go = "Alonso_Lvl_8_7";
        break;

        case "Alonso_Lvl_8_7":
            dialog.text = "Это я уж потом уяснил, что настойка эта, что мой приятель сварил, здорово руку укрепляет, когда тяжёлым мушкетом рубишься. Тут уж и правда, багинет — всему голова.";
            link.l1 = "И как это относится к твоей службе в инквизиции?";
            link.l1.go = "Alonso_Lvl_8_Gift";
        break;

        case "Alonso_Lvl_8_Gift":
            dialog.text = "Опять вы мне не верите, кэп! Держите вот.";
            link.l1 = "Склянка и лист бумаги?";
            link.l1.go = "Alonso_Lvl_8_Gift_2";
        break;

        case "Alonso_Lvl_8_Gift_2":
            // Даём игроку настойку и рецепт
            GiveItem2Character(pchar, "vodka");
            SetAlchemyRecipeKnown("vodka");

            dialog.text = "А это то зелье, про которое я вам рассказывал. И рецепт. Вдруг понравится, хе-хе.";
            link.l1 = "Прости, друг мой, но каракули и какое-то мутное варево не…";
            link.l1.go = "Alonso_Lvl_8_Gift_3";
        break;

        case "Alonso_Lvl_8_Gift_3":
            // Даём игроку мушкет с багинетом
            GiveItem2Character(pchar, "mushket10");

            dialog.text = "Ладно, ладно, кэп. Всё равно собирался вам подарить. Мне такое оружие не к лицу, а вам пригодится. Багинет — зверь редкий. Но коли научитесь — забудете на саблях махать.";
            link.l1 = "Погоди, это что, тот самый мушкет имперского офицера? Которого ты убил?";
            link.l1.go = "Alonso_Lvl_8_Gift_4";
        break;

        case "Alonso_Lvl_8_Gift_4":
			PlaySound("ambient\SEA\Ship_bell_Two.wav");
            dialog.text = "Он самый. Как видите, я рассказал вам правду, кэп.";
            link.l1 = "Но я спрашивал не об этом.";
            link.l1.go = "Alonso_Lvl_8_Escape";
        break;

        case "Alonso_Lvl_8_Escape":
            dialog.text = "Склянки пробили, кэп! Пора мне за работу, так что в другой раз.";
            link.l1 = "Мы ещё продолжим этот разговор. Спасибо за мушкет!";
            link.l1.go = "exit";
			AddDialogExitQuestFunction("LoyaltyPack_SecondStage_DlgExit");
        break;

        // (Уровень 12)
        case "Alonso_Lvl_12_Start":
			DelLandQuestMark(npchar);
			dialog.text = "Капитан, по поводу последнего набора команды…";
			link.l1 = "Что-то случилось?";
			link.l1.go = "Alonso_Lvl_12_1";
        break;

        case "Alonso_Lvl_12_1":
            dialog.text = "Хотел вам доложить, что на ужине один из рекрутов упомянул, что хотел устроиться именно на ваш корабль.";
            link.l1 = "И что это значит?";
            link.l1.go = "Alonso_Lvl_12_2";
        break;

        case "Alonso_Lvl_12_2":
            dialog.text = "Что скоро таких людей может стать больше. У вас теперь есть имя, кэп.";
            link.l1 = "А что скрывается за твоим именем, я до сих пор не знаю. И историю про инквизицию ты так и недорассказал.";
            link.l1.go = "Alonso_Lvl_12_3";
        break;

        case "Alonso_Lvl_12_3":
            dialog.text = "О, была одна авантюра... В военные поставщики решили податься. Война-то к концу шла, надо было думать о будущем. А у моего приятеля дум о будущем всегда было много.";
            link.l1 = "Это большой карьерный взлёт. Ещё недавно вы напивались у разбитого обоза с капустой.";
            link.l1.go = "Alonso_Lvl_12_4";
        break;

        case "Alonso_Lvl_12_4":
            dialog.text = "А что? Получили заказ на сотню шлемов для какого-то полка. Аванс хороший дали. Мы обрадовались, пошли отмечать... В карты сели.\n"+
                          "Утром просыпаемся — аванса нет, армия через два дня выступает, а у нас ни единого шлема!";
            link.l1 = "И что вы сделали?";
            link.l1.go = "Alonso_Lvl_12_5";
        break;

        case "Alonso_Lvl_12_5":
            dialog.text = "Пошли по полю последней битвы, насобирали шляп с убитых. Потом железки всякие поприбивали, пластины нацепили... Смешно выглядело, но работало! От сабли точно спасало. Ну, разок-то точно. Чем не шлем?!";
            link.l1 = "Квартирмейстер оценил вашу находчивость?";
            link.l1.go = "Alonso_Lvl_12_6";
        break;

        case "Alonso_Lvl_12_6":
            dialog.text = "Под трибунал отправил за растрату и мошенничество. Но знаете что? Солдаты потом говорили, что шляпы эти им жизнь не раз спасли. Ну и нам, получается, тоже.";
            link.l1 = "Как же так?";
            link.l1.go = "Alonso_Lvl_12_7";
        break;

        case "Alonso_Lvl_12_7":
            dialog.text = "Так мы в тюрьму вдвоём загремели. А нашу роту отправили на дело. Не знаю, где и против кого, да и сами они вряд ли знали. Там же всё и остались.\n"+
                          "…\n"+
                          "Простите, кэп. В другой раз продолжим. Держите шляпу и инструкцию. Смастерил вчера, чтобы вас повеселить… Да только сам зря расстроился.";
            link.l1 = "Разумеется, Алонсо. Спасибо за подарок.";
            link.l1.go = "Alonso_Lvl_12_Gift";
        break;

        case "Alonso_Lvl_12_Gift":
            // Даём игроку шляпу
            GiveItem2Character(pchar, "hat10");
            SetAlchemyRecipeKnown("Hat10");

            DialogExit();
			AddDialogExitQuestFunction("LoyaltyPack_ThirdStage_DlgExit");
        break;

        // (Уровень 16) - Финальный
        case "Alonso_Lvl_16_Start":
			DelLandQuestMark(npchar);
			dialog.text = "Капитан, просто хотел доложить, что членов вашей команды привечают в тавернах и борделях. Служить под вашим флагом — нынче большое дело!";
			link.l1 = "Спасибо, Алонсо… Жаль только, что «привечания» в свою сторону я пока не особо вижу.";
			link.l1.go = "Alonso_Lvl_16_1";
        break;

        case "Alonso_Lvl_16_1":
            dialog.text = "Значит, скоро увидите. Карибы — это пирог, который делят всего несколько дюжин капитанов. Скоро вы присоединитесь к столу и обязательно ухватите свой кусок.\n"+
                          "И кто знает, возможно, именно вы станете карибской легендой, кто заберёт весь пирог целиком.";
            link.l1 = "Так ты расскажешь свою историю до конца? Мы остановились на моменте, где ты загремел в тюрьму.";
            link.l1.go = "Alonso_Lvl_16_2";
        break;

        case "Alonso_Lvl_16_2":
            dialog.text = "Ба! Дело великих шляпных воров. Московит с португальцем в крошечной камере где-то во Фландрии. Ждут приговора. Смертного, разумеется.\n"+
                          "Спас нас какой-то важный господин — московский посол оказался! Старый приятель Фадея. Проездом был, узнал о нашей беде, выкупил нас!";
            link.l1 = "Фадея? Того самого Фадея? И ты молчал?!";
            link.l1.go = "Alonso_Lvl_16_3";
        break;

        case "Alonso_Lvl_16_3":
            dialog.text = "Ага. На том и расстались: он в Москву свою вернулся, то ли с поляками драться, то ли делами большими крутить. А я ещё по старой родине помотался, и вот я здесь.";
            link.l1 = "Впечатляет, Алонсо. Столько времени прошло, а ты умудрился рассказать о чём угодно, но только не о себе. Даже странно, как такой ловкий малый, как ты, умудрился проговориться про инквизицию.";
            link.l1.go = "Alonso_Lvl_16_4";
        break;

        case "Alonso_Lvl_16_4":
            dialog.text = "И рассказал чистую правду, кэп! Не верите — спросите самого Фадея. В Бас-Тере его найти несложно.";
            link.l1 = "Может быть, и спрошу. А подарок-то будет?";
            link.l1.go = "Alonso_Lvl_16_5";
        break;

        case "Alonso_Lvl_16_5":
            dialog.text = "А?";
            link.l1 = "В конце каждой истории ты дарил мне подарок.";
            link.l1.go = "Alonso_Lvl_16_Escape";
        break;

        case "Alonso_Lvl_16_Escape":
			PlaySound("ambient\SEA\Ship_bell_Two.wav");
            dialog.text = "Слышите? Склянки пробили. Пора за работу.";
            link.l1 = "Так держать, Алонсо.";
            link.l1.go = "exit";
			AddDialogExitQuestFunction("LoyaltyPack_FourthStage_DlgExit");
        break;
	}
} 