// диалог по городам
void ProcessCommonDialogEvent(ref NPChar, aref Link, aref NextDiag)
{
    switch (Dialog.CurrentNode)
	{
		case "quests":
			dialog.text = NPCStringReactionRepeat(RandPhraseSimple("Какие вопросы, "+ GetSexPhrase("сын мой","дочь моя") +"?", "Спрашивай, я слушаю тебя..."), "Я слушаю тебя, говори, "+ GetSexPhrase("сын мой","дочь моя") +"...", "И в третий раз говорю тебе, "+ GetSexPhrase("сын мой","дочь моя") +": задавай свой вопрос.",
                          "Столько обязанностей у церковнослужителя, а тут ещё и ты донимаешь, "+ GetSexPhrase("сын мой","дочь моя") +"...", "block", 1, npchar, Dialog.CurrentNode);
			link.l1 = HeroStringReactionRepeat(RandPhraseSimple("Я "+ GetSexPhrase("передумал","передумала") +"...", "Не сейчас, падре..."), "Да, пока особо и нечего сказать...",
                      "Задам, задам... Только позже...", "Простите, святой отец...", npchar, Dialog.CurrentNode);
			link.l1.go = "exit";
			//--> Письмо от покойника
			if (CheckAttribute(pchar, "questTemp.LFD_Church_1"))
            {
                link.l1 = "Святой отец, я ищу Марису Кальдера. Говорят, она очень набожна и постоянно посещала церковь. Подскажите, как мне её найти?";
                link.l1.go = "LFD_Church_1_1";
            }
			//<-- Письмо от покойника
		break;
		
		//--> Письмо от покойника
		case "LFD_Church_1_1":
			dialog.text = "Мариса была одной из наших самых преданных прихожанок, истинной душой нашей церкви. Её отсутствие - великая утрата для прихода. Что заставило её исчезнуть, мне неведомо, но я не сомневаюсь: на её долю выпали незаслуженные испытания, и здесь не обошлось без козней дьявола и его слуг\nИногда, до меня доходят слухи, что она появлялась в городе, но не более того. Нам остаётся лишь уповать на волю Господа и верить, что однажды она вернётся и вновь найдёт утешение под сенью церкви.";
			link.l1 = "Возможно, вы знаете кого-то, кто может рассказать о ней больше?";
			link.l1.go = "LFD_Church_1_2";
			DelLandQuestMark(npchar);
		break;
		
		case "LFD_Church_1_2":
			dialog.text = ""+GetSexPhrase("Сын мой","Дочь моя")+", скажи, зачем тебе понадобилась Мариса? Я знаю, что время от времени её разыскивают люди, чей облик далёк от облика праведника. Мир полон искушений, и не все, кто ищет её, движимы добром. Прежде чем я скажу хоть слово, я должен быть уверен: ты не принесёшь бед ни ей, ни тем, кто может быть с ней связан.";
			link.l1 = "Я понимаю ваши опасения, святой отец, но уверяю вас: у меня нет злого умысла. Я лишь хочу передать ей письмо, которое слишком долго шло к адресату. Кто знает, может, в нём содержится нечто важное для неё. Вот, взгляните.";
			link.l1.go = "LFD_Church_1_3";
			TakeItemFromCharacter(pchar, "LFD_letter");
			notification("Отдано: Письмо для Марисы Кальдера", "None");
		break;
		
		case "LFD_Church_1_3":
			dialog.text = "Да, письмо это, похоже, пережило немало бурь и штормов, прежде чем оказалось у вас. Кто знает, что в нём написано, и каковыми будут последствия после его прочтения... Но вы поступаете благородно, капитан, возвращая его адресату. Если кто и ведает, где сейчас находится Мариса, так это её подруга Долорес Моньо - единственная, кому она могла довериться\nЕё дом находится слева от портового управления. Надеюсь, что это письмо не принесёт Марисе новых страданий, ведь испытаний у неё и без того было предостаточно.";
			link.l1 = "Благодарю вас, святой отец. Да хранит вас Господь.";
			link.l1.go = "LFD_Church_1_4";
			GiveItem2Character(PChar, "LFD_letter");
		break;
		
		case "LFD_Church_1_4":
			DialogExit();
			AddDialogExitQuestFunction("LFD_Church_1");
		break;
		//<-- Письмо от покойника
	}
	UnloadSegment(NPChar.FileDialog2);  // если где-то выход внутри switch  по return не забыть сделать анлод
}



